[
  {
    "settings": {
      "showHousekeeping": false
    },
    "date": "2018-04-23T16:46:06.000Z",
    "body": "\n[Schedule](http://www.microconf.com/starter/schedule/)\n\nUp next:\n\n* Marie Poulin\n* Courtland Allen\n* _NAP_\n* _7:30pm: Closing reception_\n\nSponsors:\n\n* [Azlo](https://www.azlo.com/tech/): an API for your bank account\n* [Stripe](https://stripe.com): payments API\n* [Sassler](https://www.saasler.com/): like Zapier embedded directly in your app\n* [SaaSicorn](https://saasicorn.com/): SEO Agency\n* [kickofflabs](https://kickofflabs.com/): makes [bad art](https://twitter.com/kickofflabs/status/991783698583379968) of these talks; refer-a-friend style giveaways. [free 3 months microconf offer](https://grow.kickofflabs.com/microconf)\n"
  },
  {
    "title": "Nailing Your First (Info-Product) Launch",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/887661330832003072/Zp6rA_e2.jpg",
      "name": "Adam Wathan",
      "title": "Owner, NothingWorks Inc.",
      "bioUrl": "http://www.microconf.com/starter/speakers/adam-wathan/",
      "twitter": "adamwathan",
      "website": "http://adamwathan.me",
      "location": "Cambridge, Ontario, Canada",
      "description": "Building @tailwindcss, teaching Test-Driven Laravel, and hosting @fullstackradio. Still listening to Slayer.",
      "verified": false
    },
    "date": "2018-05-02 11:20:46 UTC-07:00",
    "conference": "starter",
    "description": "Microconf 2018 talk recap",
    "image": "https://i.imgur.com/AlS4ozN.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1678073645574592%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/adam-wathan/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n# Who The Hell is Adam Wathan?\n\n<!-- https://twitter.com/mijustin/status/989174075695120385 -->\n\nAdam started his career as a fullstack developer. He's always wanted to launch a side project (so he could get rich and be on the cover of tech crunch).\n\nAdam's first attempt at a product came from an idea he had for automating code reviews in PHP. He spent months and months coding it alone, then one day tweeted out an announcement for [Nitpick](https://nitpick-ci.com/) and expected the fame and money to come rolling in.\n\n![Refactoring to Collections launch sales #small](https://i.imgur.com/rBf7Rhd.png)\n\nThat launch was in November of 2015. Since launching, it's only made $3,650 in sales from 19 customers.\n\nWorking a full time job, Adam didn't have the resources to grow Nitpick and started looking for another way to make a living with an online product.\n\nThe next thing he tried was an infoproduct - Refactoring to Collections (launched in May 2016). Adam spent time researching successful product launches this time so he could get the process right.\n\nIn the first three days Refactoring to Collections made $61k - about 17x what Nitpick has ever made.\n\n<!-- ![Adam's sales in just his first two years of info-product business #small](https://i.imgur.com/0vNvKhC.png) -->\n\n![Test Driven Laravel launch sales #small](https://i.imgur.com/TFvQ0Mk.png)\n\nTwo weeks later, Adam felt confident enough in his ability to launch that he quit his job to work on products full time.\n\nHis next (and much more ambitious) product was [Test Driven Laravel](https://course.testdrivenlaravel.com/). Adam launched Test Driven Laravel six months after launching Refactoring to Collections to $116k of revenue in the first three days.\n\nIn two years (May 2016 to April 2018), Adam has made about $650k from launching info products, so he knows what he's talking about.\n\n# Info Products\n\n![Rob Walling hadoukens his Stair Step approach - a great model for starting with an info-product instead of a SaaS #medium](https://i.imgur.com/IvrS4Iq.jpg)\n\n## Why an Info-Product?\n\n- One-time purchase products are way easier to sell. Don't we all have an ebook saved on our laptop that we bought and never actually read? The person who made that ebook has your aspirational $20, but the $4 re-occurring charge for a service that you canceled when you didn't use it one month isn't getting your money anymore.\n- They can be \"done.\" A SaaS has to be maintained forever, but an ebook or course has a finish line.\n- You can put one together in 3 months of nights and weekends.\n- They put money in the bank fast, then drop off, which is the opposite of the SaaS ramp of death. That fast money up front can be used to bankroll your time so you can invest in other things (like a Saas?).\n\nhttps://twitter.com/brennandunn/status/982326554414985216\n\n# Getting Started on Your Info-Product\n\n## Why build an audience?\n\n- Having a large audience can make up for any other deficiency in your marketing plan. A huge audience and a terrible strategy beats a perfect marketing strategy and no audience.\n- You can't just throw up a landing page and expect people to sign up; people need to trust you and believe that you're the right person to help them. An audience is effectively a collection of people who already trust you and know that you're good at helping them, so they're much easier to sell to.\n\n## How do you build an audience?\n\n> A large audience can make up for any other deficiency in your marketing plan. Build one by being helpful on the internet.\n\nBe helpful on the Internet! This means blog posts, tutorials, screencasts, podcasts, interviews, anything that makes you worth following.\n\nA specific strategy that works well for Adam, which he stole from his friend @wesbos, is to help people where they already are.\n\nhttps://twitter.com/wesbos/status/984500364245389312\n\nWhere are people? The type of person Wes Bos is interested in helping - web developers - are on Twitter! Wes Bos doesn't tweet links to blog posts somewhere else; he helps web developers as they're scrolling through twitter. This strategy earns Wes fantastic engagement and an enormous audience.\n\nAdam frequently tweets [these same bite-sized useful nuggets](https://twitter.com/adamwathan/status/829423543985307661) to his audience of Laravel developers (who are also already on Twitter).\n\n### Case Study: Steve Schoger\n\nBuilding an audience can be daunting if you're starting from zero, but it's simple if you follow the strategy.\n\nIn Setember 2016 [@steveschoger](https://twitter.com/steveschoger) had 436 twitter followers. He was tweeting typical social media updates (\".@Fedex has the worst customer service ever...\"), which no one cares about.\n\nhttps://twitter.com/steveschoger/status/981606881255976961\n\nBut he wanted to grow his audience, so Steve started posting helpful tweets about his area of expertise: design. These helpful tweets got way more engagement right away ([18 retweets and 246 likes on a tweet](https://twitter.com/steveschoger/status/870679289624092673) when Steve only had 800 followers).\n\nIn less that a year and a half, using the strategy of helping people where they are, Steve has jumped to over 20k followers, and his tweets typically get thousands of likes.\n\n# Picking the Right Idea\n\n## Step 1: Have an Idea\n\n- What are you already putting out there that people seem excited about?\n- What are you excited about that you think others will get excited about? What do you think you are ahead of the curve on?\n- What do people think you're better than them at? What sorts of questions are people asking you? If people think you're better than them at something, that's an opportunity to teach.\n\n> You could be the Christopher Columbus of programming knowledge.\n\n- What have you learned outside your community/watering hole that you think your community would benefit from? That's right, you don't have to invent these ideas yourself, you can just re-package things that already exist!\n- What did you have to figure out yourself that was really helpful to learn? Other people are probably struggling with the same thing, and you could make it easier for them!\n\n## Step 2: Test It\n\nSome people would tell you to throw up a landing page first thing and try to get people's emails to see if people are interested in your idea. But Adam thinks you should do these things first:\n\n- Tests ideas with [small tweets](https://twitter.com/adamwathan/status/956620857236959232) (or message board posts, or whatever else you use to communicate with your people):\n- If it looks like things are working in a small format, move on to a longer form, like a high quality, long-form, comprehensive blog post.\n\nhttps://twitter.com/adamwathan/status/976909385938059264\n\n- Catalog any good feedback you get about this test content, like replies on Twitter (\"this is the guide I wish I had when I was learning!\"), blog post comments, etc. This feedback will be useful when building your landing page.\n\n## Step 3: Define the Product\n\n- Start by planning small, because the product will end up bigger than you think. Planning small will also help you be concise: a short book is still a book, and a 3 hour video course can totally be sufficient.\n- Books are a lot easier to work on than products that require recording, like courses, especially if you only have short blocks of time.\n- Courses are easier to sell at a higher price than books (which people are conditioned to think should cost $20-$40, even if it's a specialized book that provides a lot more value), but a lot harder to produce on nights and weekends.\n\n# Putting up a Landing Page\n\nThe landing page collects your email addresses, and confirms that people are interested in this topic as a product, not just a tweet.\n\n- Start with a clear headline that explains what users will learn from your product. For Adam's [Advanced Vue Component Design's landing page,](https://adamwathan.me/advanced-vue-component-design/) that headline is: \"Learn how to design simpler, more flexible components that are both more powerful and easier to maintain.\"\n\n![Advanced Vue Component Design's Landing Page](https://i.imgur.com/YVfPkj5.jpg)\n\n- Next, give people a clear incentive to sign up for your email list - not just \"sign up if you're interested!\" Give them a reason to give you their email address! Promise them some free content. In the example above the incentive is clear: \"Sign up for **free screencasts** and a **big discount** when the course is released this May.\"\n\n- Be sure to give people some evidence that proves you know what you're talking about. On Adam's landing page the link to [Renderless Components in Vue.js](https://adamwathan.me/renderless-components-in-vuejs/) proves Adam is an expert. He's the real deal - you can trust him.\n\n- Throw in pieces of social proof that you know your stuff, like the testimonials you collected when testing your content. This doesn't have to be a review from an influencer, it just has to serve the same purpose as an Amazon review.\n\n![The link to Adam's previous work, Renderless Components in Vue.js, and the review from a fan help convince landing-page-viewers that they can trust Adam as an authority, which makes it more likely they'll give him their email. #large](https://i.imgur.com/LnvKNih.png)\n\n- Then, outline what you're planning to do with your product. Keep it simple.\n\n- At the end of the page drop another sign up form, with a little bit more social proof. This is for those people who needed to read your whole page to be convinced to give you their email.\n\n- Finally, finish up your page with a little \"Who Am I?\" section. Link to Twitter, any other products you've already released, or even just cool things you've made or done, like your blog, conference talks, etc. This is another way to convince someone that you can be trusted to know what you're talking about.\n\n# Side Note: Should You Pre-Sell?\n\nAdam has done it both ways: he completely finished and then released his first product, and released his second product in early access when he was done with 20%, then added new content as he went on. Both ways have tradeoffs.\n\n## Pre-selling Advantages\n\n- Pre-sales are the best form of product validation. If someone gives you money before you've created it, that's great proof that they're actually interested.\n- You'll make more money because you'll have more opportunity to promote the product by telling people about product updates, without seeming spammy with \"buy this! buy this! buy this!\" emails. You can send out non-spammy update messages as you publish more content.\n- You might have more motivation to finish. If you already have people's money, you'll push through burnout. You don't want to not deliver on something people have already paid you for.\n- Pre-sales can buy you the time to focus on the product. If you have a successful pre-launch, you can afford to do less freelance work to buy more of your time for this product.\n\n## Pre-selling Disadvantages\n\n> \"Holy fuck I gotta finish this thing or people are gonna be so fucking angry.\"\n\n- Selling multiple tiers is trickier. It's harder to get people to buy the more expensive packages if right now all users get the same thing from your product (because the fancy add-ons aren't ready yet).\n- You can't easily change scope. Cutting scope is a great way to make your goal more attainable, but if you pre-sell and promise too much, then you can end up in a situation where it takes you way longer to finish, which is a beat-down.\n- Prelaunching is like taking on debt. Mechanically, pre-sales make you more money. Psychologically, they can be really stressful.\n\n# Building Your Email List\n\n## Step #1: Tell Your Audience\n\nhttps://twitter.com/adamwathan/status/978661856687484928\n\nTelling your audience you have a landing page they can sign up for is an obvious step. You can get an extra boost by first announcing that you're going to announce your landing page before you announce it.\n\nThese pre-pre-launch announcements won't get much engagement, but they prime your audience to share your real announcement.\n\nThen, announce to your existing audience.\n\n![https://twitter.com/adamwathan/status/988443466890854402](https://i.imgur.com/H863Pkw.png)\n\n## Step #2: Share Progress\n\nYou usually get your biggest spike in sign-ups at launch. It's easy for sign-ups to drop off completely after the announcement, but you can help sustain sign-ups by keeping your list engaged and excited about the product by sharing updates, especially updates with a bit of free content.\n\nIf you don't have anything free to send out, just send out a [behind-the-scenes work update](https://twitter.com/adamwathan/status/987362810521792512).\n\nDon't just share these updates with people who have already signed up. Put pre-launch updates on public watering holes your audience hangs out at too (like Twitter), to encourage new people to sign up.\n\n## Step #3: Re-purpose Content\n\n![Re-purpose the content you already have. This blog post is a lesson from Adam Wathan's paid video course that he's massaged into a more sharable format.](https://i.imgur.com/5YaplDi.png)\n\nIf you're working on this project part-time, then it can be hard to also be generating content to market your product. It's much easier to re-purposing your main content into a stand-alone blog post.\n\nBe sure to mention that your re-purposed content is from a product that you're currently making, and throw in a call to action for sign-ups.\n\n# Getting It Finished\n\n## Strategy #1: Make Public Promises\n\nPromising things to people on public platforms can make you feel accountable and motivated to deliver.\n\n## Strategy #2: Email on a Schedule\n\n> I'm afraid to go a week without emailing people.\n\nFor Adam's audience, emailing once a week makes sure people stay excited and don't forget about what he's working on.\n\n## Strategy #3: Reduce Scope\n\nIf you find you've been working on your product for 6 months, but there's no end in sight, and you already have something substantial, then just move the finish line closer by reducing the scope of your project.\n\n# Figuring Out Pricing\n\n## Topic #1: Tiered Pricing\n\n### Single Tier/No Tier Pricing\n\n- Can be fine if you can charge enough for your one tier.\n- Often necessary if you're pre-selling.\n- Nice if you can't figure out a way to add additional tiers that actually feel valuable.\n\nIn general though, prefer multiple tiers.\n\n![Wes Bos's second tier is only $10 more, but it has twice as much content, displaying the price anchoring strategy.](https://i.imgur.com/8jjKhqg.jpg)\n\n### Two Tier Pricing\n\nUse price anchoring: make the second tier your real product, with the first tier as a reduced version of your product that really only exists to push people to the second tier.\n\n- The first tier is just there to make the second tier look like a better deal, since the prices are close and the content is directly comparable.\n- This works well with video courses, where it's easy to cut content for the budget version.\n\n![Even though the top tier of Adam's book Refactoring to Collections only sold 220 copies, it made the most money thanks to bonus content that wasn't even as valuable as the book.](https://i.imgur.com/XdTnSaI.png)\n\n### Three Tier Pricing\n\n- Great for books if you can come up with the bonus content.\n- Makes it easier for users to evaluate your product on its own instead of comparing it to Amazon book or something else.\n- Prices are usually 1x, ~2x, and ~5x (ex: $29, $59, and $135 for Refactoring to Collections).\n- This will make you a lot more money from a book than just selling the book on its own. Adam's first $29 tier made $7,400, his second $59 tier made $24,800, and his third $135 tier made $29,000. Without the second and third tier, Adam would've left 58% of the money on the table.\n- Adding content to tiers helps people evaluate the product as its own offering instead of just a cheap pdf, even though the bonus content you throw in isn't necessarily as valuable as the book.\n\n## Topic #2: Launch Discounts\n\n- Discount it by enough to be appealing, at least 30%.\n- Use stepped discounts. Lower discount on cheaper tiers and better discount on higher tiers will push people up to the better tiers.\n- Reverse engineer the non-discounted price from your planned discounted price. That means don't discount the price you want to charge! Pick the price that you want to charge (ex: $79), make that the \"discounted\" price, and make the \"un-discounted\" price your preferred price plus whatever you're taking off with the discount (ex: the original price of a $79 book that's been discounted by 30% is `79/(1-0.3) ≈ 113`, so set the original price at $119).\n\n# Nailing the Launch\n\nThis is actually the easy part of the whole thing!\n\n## Step #1: Build the Sales Page\n\n![The Refactoring to Collections product tiers. The most expensive one is first and looks like it includes a lot more stuff.](https://i.imgur.com/9XxDoBD.png)\n\n- Even once you've launched, include an email sign up! A lot of people are tire-kickers who are just on your page to see free content. Once you have their email though, you can try to sell them stuff.\n- Use testimonials and social proof. You can use feedback from preview content to start off.\n- Sort tiers from highest price to lowest price, and make sure your visuals communicate that your highest tier is the biggest, most real product that people should want.\n\n### Step #2: Announce the Launch Details\n\n- Send out an email saying: I got it done. Include all package and pricing details, as well as the launch date.\n- If you can, send out some final free content.\n\nAdam published [a detailed blog post of his Refactoring to Collections launch](https://adamwathan.me/the-book-launch-that-let-me-quit-my-job/) which includes the emails he sent at every stage of development.\n\n![One of Adam Wathan's early launch emails for Refactoring to Collections from his blog post: https://adamwathan.me/the-book-launch-that-let-me-quit-my-job/ #large](https://i.imgur.com/sXdkjLN.png)\n\n### Step #3: Launch It\n\nThe easiest and most fun part!\n\n- Send out a simple email: \"It's available, all the info is here at the website.\"\n- Leverage your time zones if you need to. Adam uses morning Eastern Time Zone to launch things because he has a lot of European customers.\n- Pick you favorite day to send it\n\n> I like Tuesdays. I have no evidence, but it seems like a good day to launch things. Monday is too early, every other day seems too late. Tuesday seems fine.\n\n- Sit back and make money!\n\n### Step #4: Leverage Early Feedback\n\nYou're not done! You still have more emails to send.\n\nCatalog feedback from the first people who buy your product, including tweets.\n\nhttps://twitter.com/philwinkle/status/733273064201392128\n\nA couple days later send an email to everyone that hasn't bought your product yet with this early feedback, and a bunch more people will buy it!\n\nSend another free preview if you can. Don't be afraid of giving out free content! Adam has given out about 60% of his content for free.\n\n### Step #5: Closing the Launch\n\nDon't specify a closing date in advance.\n\nHaving a specified launch closing date can make you feel obligated to shut down a launch discount that is making you tons of money. Adam has done that. It sucked.\n\n> I had a money hose that was just like firing money at me, and I was just like \"Oh, we gotta get this under control! We gotta turn this off! I don't want this money!\"\n\nTell people that during the launch there will be a discount, and don't specify how long the launch will be. If anyone asks, just say it's closing \"within the next couple of weeks.\"\n\nLook at a graph of your sales to see when sales are slowing down and plan a closing date about a week after that.\n\nYour email announcing the launch sale ending will generate another bump in sales.\n\n# Adam Wathan's Recommended Microconf Resources\n\nSource: [Adam's Github Info Link](https://gist.github.com/adamwathan/30dc4230ac575cfa3425b39ca11ea859)\n\n## Tools for selling your product online\n\n- [Gumroad](https://gumroad.com/): _what I use, biggest pro is you just get a single deposit each week direct to bank account, no dealing with Stripe/PayPal directly, so much easier for accounting/book-keeping, especially if you live somewhere where you need to worry about collecting sales tax_\n- [Podia](https://www.podia.com/): _bring your own Stripe/PayPal but has a great course editor which Gumroad doesn't have_\n\n## Email marketing tools\n\n- [ConvertKit](http://mbsy.co/convertkit/20592464): _what I use, no complaints_\n- [Drip](https://www.drip.com/): _also great, would have no reason to switch away if I was using it_\n\n## Sales page examples\n\n- [Refactoring to Collections](https://adamwathan.me/refactoring-to-collections/): _my first product_\n- [Test-Driven Laravel](https://course.testdrivenlaravel.com/): _my second product_\n\n## Coming soon page examples\n\n- [Advanced Vue Component Design](https://adamwathan.me/advanced-vue-component-design/): _my next course_\n\n## Reading material\n\n- [Recap of my Refactoring to Collections launch](https://adamwathan.me/the-book-launch-that-let-me-quit-my-job/): _includes tons of details, full content for every email sent, etc._\n- [\"Authority\"](http://nathanbarry.com/authority/): _book by Nathan Barry (best price here: https://gumroad.com/l/authority)_\n- [\"An eBook pricing model that resulted in $100,000 in sales\"](https://blog.asmartbear.com/selling-ebook.html): _blog post on tiered pricing_\n\n# Question\n\n**From your charts it looked like you had huge revenue spikes at launch, but also a long tail of revenue on both products. Did you re-prime the pump?**\n\n_Those charts are just for the first three days, so that wasn't a huge tail._\n\n_When I've released in early access before, it's been easy to update people about new content, which gets new people to see and buy the product, especially since it was still at an early access price._\n\n_For my book, sales dropped off very seriously after the launch was over, which is why I feel like I made a big mistake in closing the launch after three days._\n\n_I got around this mistake a little by sending out an email telling people that they could still get the launch discount because I had gotten back feedback that people had just been unable to get to the launch discount in time._\n\n_In general now, I send people free content over 2 weeks after the launch, and if they haven't bought the product by then I send them a coupon for a big discount that expires really soon, which encourages people to buy immediately. This is stolen from Brennan Dunn._\n"
  },
  {
    "title": "Why (and how) to start thinking about teaching people how to use your product... even if it isn't built yet",
    "speaker": {
      "email": "alli@alliblum.com",
      "image": "https://pbs.twimg.com/profile_images/3248602470/3b84cc1ed8c30e766002a79b5e907ad6.jpeg",
      "name": "Alli Blum",
      "title": "SaaS Onboarding Optimization Consultant",
      "bioUrl": "http://www.microconf.com/starter/speakers/alli-blum/",
      "twitter": "AlliBlum",
      "website": "http://www.alliblum.com",
      "location": "New Jersey",
      "description": "SaaS Trial Optimization. Bylines @kissmetrics @CrazyEgg & @Autopilotus @mixpanel. I don't tweet. Email me at alli@alliblum.com",
      "verified": false
    },
    "date": "2018-05-02 13:30:11 UTC-07:00",
    "conference": "starter",
    "description": "Is it crazy to think about onboarding before you have something to onboard people onto? Should onboarding be a priority when you're still teeny tiny? We'll talk about how your early stage actually gives you an unfair advantage–and how to use it.",
    "image": "https://i.imgur.com/aj9U5K5.jpg",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1678190282229595%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<!-- <iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/alli-blum/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script> -->\n\nCheck out [Alli's additional resources and slides](https://alliblum.com/microconf-2018/).\n\nhttps://twitter.com/mijustin/status/988987210828464129\n\n> Onboarding is really helping people get started and being successful.\n\nYou may wonder: “Is it crazy to worry about onboarding now?”\n\n_“Is it misguided to think about showing new users a product before you’ve built it?”_\n\n_“How can you even do onboarding before you have something to onboard someone onto?” _\n\n_“Uh...what’s onboarding?”_\n\nNo! It will give you a huge advantage, and you should start now.\n\nWe'll cover:\n\n* The forces that stop people from becoming customers\n* The information you need to design onboarding sequences\n* How to turn that information into messages to help people overcome the forces stopping them from becoming a customer\n\nOnboarding touches a little on copywriting, user research, and customer success.\n\n![Onboarding can seem scary and complicated](https://i.imgur.com/UkXteZ5.png)\n\n![](https://i.imgur.com/xSzYaWr.png)\n\n> People don't want software, they want their problems solved.\n\n![](https://i.imgur.com/fERfr8A.png)\n\n![Don't actively make it more difficult for people to get started and solve their problems](https://i.imgur.com/yu0taji.png)\n\nThis mountain is scary and hard because of a lot of **hidden work**. The “Hidden Work” in your SaaS trial includes things like....\n\n* Forcing your users to figure out what to do first\n* Forcing your users to watch a 22 minute video before they can even get started\n* Forcing your users to become an expert on your product before they even know if they like it\n\n## Product-Centric Work\n\nProduct-Centric Work (aka, the work of figuring out how to use a new product)\n\nHere are 3 examples of emails you may have gotten in your inbox.\n\n### 1. The Vacation Photos Approach\n\n![The Vacation Photos Approach sucks. Watching people's vacation photos is terrible.](https://i.imgur.com/dXzABJ9.png)\n\nYour user just wants to do something simple - like importing their data. Don't make an onboarding experience. That makes it a lot harder to get started. Don't make your users watch your vacation videos before they can eat the deviled eggs.\n\n> Don't make your users watch your vacation videos before they can eat the deviled eggs.\n\n### 2. The “Too Much Too Soon” Approach\n\nDon't give people too many options. It doesn't increase the likelihood they'll take action on it.\n\n![Each blue line is a call to action. Overwhelming!](https://i.imgur.com/6EZTmIk.png)\n\n### 3. The “Bad Intern” Approach\n\nDon't make your users figure out what they need.\n\n![The Bad Intern approach to onboarding - bleh](https://i.imgur.com/Qlq6fz3.png)\n\n![Don't give your users homework - help them solve their problems](https://i.imgur.com/eUYfuCI.png)\n\nPeople are signing up because they have a problem they want to solve. If you make it hard, only the most committed will get through your bad onboarding.\n\n### A Better Approach\n\n> No one wants software. Everyone wants their problems solved.\n\n![Create a Project! Yes, that's what I want to do. Great onboarding.](https://i.imgur.com/5tfdgaK.png)\n\nWhat information do you need to build onboarding email sequences?\n\nIt doesn't have to look like a scary email sequence. Think about it as a series of emails that each want your user to do an action.\n\n![28 emails are much simpler if you think of them as a series of actions that get your users to solve a problem](https://i.imgur.com/SG8tHN2.png)\n\n## Internal Work\n\nInternal Work: aka, the work of forcing yourself to do the thing you think you might want to do\n\nWhat’s the “job” that your customer hires you to do?\n\n* What’s going on in their world that made someone consider your product?\n* What outcome are they looking for?\n* What do they believe about their problem?\n\nThis is effectively the [Jobs to be Done](https://microconf.gen.co/claire-suellentrop) framework.\n\n> Your customer’s biggest problem is unlikely to be that they want to try your features.\n\nYour customer may hate software, but still have the pain your software solves.\n\n![How to set up a Very Basic Onboarding Automation for a brand new product](https://i.imgur.com/M248mR7.png)\n\nAsking your cusomters \"hey, what's going on in your world?\" is a **gold mine** of data.\n\n![](https://i.imgur.com/bmyCSs6.jpg)\n\nWhen you're doing this customer research, look for outcome phrases:\n\n* “so that”\n* “because”\n* “I want to”\n* “that way”\n* “so I can”\n* “I’ll be able to”\n* “what I want to do is”\n\nWhere do you put this research? Try:\n\n* [Airstory](https://www.airstory.co/): free tool for clipping, organizing, and writing with voice of customer data\n* [Nomnom](https://nomnominsights.com/): aggregate customer feedback on an existing project\n* [Usability-Hub](https://usabilityhub.com/): get feedback on usability\n\nDon't just _pretend_ to go through UX research (\"UX theatre\"). Ex: find a random quote and try to pass it off as a customer quote.\n\nhttps://twitter.com/spydergrrl/status/955218540977631232\n\nIf your product isn't based in user feedback, you have a huge cultural problem.\n\n## How do you write emails?\n\nWhat should an onboarding email do? Get your customers to come back. Everyone is always leaving.\n\nHow? Three things:\n\n1.  Message-Matching: Get them to overcome their internal hurdles.\n2.  Instructions: eliminate the product-centric work involved with doing what you're asking them to do\n3.  Call to action: invite them to complete the action they need to take now.\n\n![](https://i.imgur.com/6uHBS6z.png)\n\nBananaBlaster fictional example:\n\n![BananaBlaster helps you keep track of your bananas](https://i.imgur.com/GhE0lG5.png)\n\n![](https://i.imgur.com/02PzMyr.png)\n\n![](https://i.imgur.com/uzphezc.png)\n\n![Exact Phrase Message Matching in action on BananaBlaster](https://i.imgur.com/l87JoQf.png)\n\nDon't make people watch a 35 minute video, just tell them how to solve their problems.\n\nYou should also pay attention to how your customer is going to be using this information. Are they going to be on the subway and can't load your links?\n\n![Testing is Dead. Long Live Testing. You guys got that this is like \"The Queen is Dead Long Live the Queen\" right?](https://i.imgur.com/mkgbkXj.jpg)\n\n![ Joining the conversation happening in your reader’s head works.](https://i.imgur.com/ozMUGha.png)\n\nYou can say \"there are 35 ways to use this project\" but it doesn't work as well as joining the conversation happening in your reader's head and solving the problem they're having _right now_.\n\nMaking it easy to get started works. Harvest's \"Create a Project\" email hasn't changed in years.\n\n![Talking to people like they are real people works.](https://i.imgur.com/4O0sH20.png)\n\n![Getting rid of the hidden work involved with learning a new software works.](https://i.imgur.com/7oy0Wix.png)\n\n## Takeaway\n\nTo help your customers get started, get the right mindset:\n\n* You’re teaching people something new\n* You’re solving their problems\n* You’re eliminating hidden work\n\nThanks to:\n\n* Tanya Snook for letting me quote her\n* Val Geisler for letting me quote her case study\n* Sofia Quintero at Nom Nom for sharing data on her emails\n* Jane Portman for sharing results from her Tiny Reminder email\n* Coral Edwards for sharing backstory on Harvest\n\nCheck out [Alli's free course on onboarding](https://alliblum.com), [email her](mailto:alli@alliblum.com), and [download her slides](https://alliblum.com/microconf-2018)\n\n---\n\n# Questions\n\n**Do you start off users with the first email in each action?**\n\nYes, then drill down.\n\n**In your examples of emails, they're all plaintext. We've noticed those do a lot better (because people are sick of the Mailchimp template). Our current onboarding series can't be plaintext because they have screenshots.**\n\nYeah, start with plaintext. Also test what works best for you.\n\n**You touched on the \"what's up in your world\" research emails and the \"here's our product\" call to action emails. Are those separate? In the same email?**\n\nDo it separately. Keep people tightly focused on a single action.\n\n**How do you consider in-app onboarding?**\n\nYou want both in-app and email onboarding. Email onboarding is for when they leave.\n\nAlso, a lot of onboarding in-app happens right when you sign up, but often people sign up at 2am when they're not ready to actually onboard.\n"
  },
  {
    "title": "From $0 To $10M ARR: The Tactics We Used To Scale Teachable",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/922551419206553602/v-h5PUmH.jpg",
      "name": "Ankur Nagpal",
      "title": "CEO, Teachable",
      "bioUrl": "https://www.microconf.com/growth/speakers/ankur-nagpal/",
      "twitter": "ankurnagpal",
      "website": "http://teachable.com",
      "location": "New York, NY",
      "description": "Founder @Teachable. Twenty inch blades on the impala. DMs open if you wanna holla.",
      "verified": true
    },
    "date": "2018-05-01 13:39:03 UTC-07:00",
    "conference": "growth",
    "description": "Microconf 2018 talk recap",
    "image": "https://i.imgur.com/jl5QfLo.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fteamlanio%2Fvideos%2F1677114439003846%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/ankur-nagpal/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\nhttps://twitter.com/patio11/status/991425694583341056\n\nSaaS is supposed to be super exciting:\n\n![Expectation of revenue](https://i.imgur.com/Gupffe5.png)\n\nBut in practice it was really boring for Teachable:\n\n![Teachable had a boring revenue slope](https://i.imgur.com/nDPEiNk.png)\n\nHere's how they did it over four years:\n\n![Teachable's 4 year journey](https://i.imgur.com/dmSzJU4.png)\n\nIt took 64 people to get there.\n\n![Teachable overview at 10M ARR](https://i.imgur.com/ehBQGCE.png)\n\n# How Teachable architected growth on the backend\n\nThe growth model Teachable followed was:\n\n* Growth was the priority.\n* How can we leave as little to chance as possible?\n* Let's take advantage of being small enough that we can strong-arm growth by doing things that do not scale.\n\nThey waned to account for where every dollar was coming from.\n\nHere's how it played out in August 2015:\n\n* end of July 2015 MRR: $25k\n* Desire month-on-month growth rate: 30%\n\n![Calculating needed revenue to hit a target MRR](https://i.imgur.com/36Rd3Yq.png)\n\n`Math math math`, they needed $10,843 to hit 30% growth. Where does that come from?\n\nIf they _did nothing_, expected MRR would be $8k.\n\n![Calculating expected MRR](https://i.imgur.com/pPyzoNO.png)\n\n\"Revenue to be found\" is therefore `$10,843 - $8,000 = $2,843`.\n\nBy the end, they \"had to find\" like a hundred thousand dollars, which was unfeasable. Early on, this number was a necessity that drove all marketing strategies. The number is also small enough to actually hit, and much better than just flying blind.\n\nBy targeting such a high number, they had to drive tactics that would have a shot in hell to hit the numbers.\n\n![Example plan to hit the numbers: add in a few partner promos](https://i.imgur.com/VJS5SMP.png)\n\n## Growth Strategies at every growth stage\n\nTo find an exrtra **$500-$1k**/month, the strategy could be 1-1 direct sales based on personally sent cold e-mails.\n\nTo find an extra **$1k-3k**, the revenue could be found by 1-many sales to our audience by hosting a big webinar every month.\n\nThe next level up in growth, **$3k-$5k**, could be found by hosting a weekly reoccurring webinar every Thursday driving $1k in new MRR / week.\n\nA strategy to finding an extra **$5k-$10k**/month could be layering on joint venture webinars with influencers in the space every week with target of $1k in MRR / partner.\n\n> At every stage, the necessity of having to discover this revenue was the fuel behind all of our big growth innovations.\n\n## Dismal Failures and Successful Strategies\n\n**Idea 1**: Pitch customers with a predesigned website with their content refactored and uploaded from other sites to impress them upfront.\n\nThat failed because Seth Goden's people complained about piracy :(\n\n**Idea 2**: A bot that tried to find e-mail addresses for everyone on Udemy and initiate a cold email from my personal Gmail telling them to use us instead.\n\nThat failed because the first person it \"found\" was the founder of Udemy :/\n\n![yikes](https://i.imgur.com/wX1jeJA.png)\n\n**Idea 3**: Instead of inviting partners to our audience one at a time, why not aggregate all of them and have them all promote the same bigger event they all contribute to - aka \"the summit\"?\n\nOh hey that worked! $25k in new MRR from the first event, and eventually up to $50k in new MRR from repeating those events. This was one of the big pivot points that made Teachable work.\n\n**Idea 4**: Change the price of our Basic plan from $29 -> $39 since we added a bunch of functionality to it. We experimented with letting existing users claim it at the old price for a week before the change went into effect.\n\nOh hey that worked too! Usually in a SaaS, your LTVs will slowly go up over time with a price raise. By letting people get grandfathered into the old price, it drove $20k in new MRR for the duration of the campaign immediately.\n\n> The necessity of \"finding revenue\" lead to the discovery of some of our best growth strategies.\n\nBeing driven by revenue goals helped sanity check projects that sounded great but wouldn't have driven growth.\n\nPulling this crazy growth out of nowhere month after month for 24 months had several secondary benefits:\n\n* Built momentum and morale internally - everyone wants to work on a “winning team”\n* Helped us raise capital at terms we wanted because of “traction”\n* Growth begets growth - the bigger you get, the more your \"mini-brand\" grows\n\nIf Teachable failed to hit their growth, they could analyze why:\n\n![If we failed to hit our growth goals, we'd know why](https://i.imgur.com/vOcEVZo.png)\n\n## When things come crashing down\n\nAfter you're at ~$500k MRR, the \"found revenue\" gets insane:\n\n![Where the growth model breaks down](https://i.imgur.com/z7irlfb.png)\n\nEven if you earn $50k in a summit, you're barely making a dent in finding 6 figures a month. **The strong arm method stops working.**\n\nWhat do you do then? Look back to the product and customer. What if you could make another 5% from each existing customer?\n\n## Effective Growth 2.0 Strategies\n\nAfter this $500k MRR inflection point, you have to move one of:\n\n* Organic new customers added per day\n* Decreasing churn rate\n* Average revenue per customer.\n\nThis method is more about repeatable growth and leveraging existing customers.\n\nWhat does that look like?\n\n**1. Over hire for customer success**: During their scaling process, Teachable had as little as 1 Customer Care rep supporting every 1,000 paying customers. Today, it is 1 to 600.\n\n![Customer metrics for Teachable improved dramatically by focusing on customer success](https://i.imgur.com/xSLEnjM.png)\n\nThis also reduced churn. The difference between 5% and 6% churn at $500k MRR over 2 years will cover a payroll for **20-30 customer care agents**. Investing in customer success is worth it at this scale.\n\n**2. Materially improve checkout product**: Since we make money of payment processing, increased revenue per customer without needing new customers.\n\n![Improving the checkout to this slick single page increased sales from $250k/day to $400k/day](https://i.imgur.com/GanI2QT.png)\n\n**3. Make the $99/month plan more attractive**: average customer revenue per paying customer jumped from $48/customer to $60/customer (today it's $67).\n\n![Making the $99/month plan more attractive changed the slope of Teachable's growth rate](https://i.imgur.com/WMtfnBr.png)\n\n## Don't make the same mistakes as Teachable\n\nTeachable spent ~6 months after hitting $500k MRR trying to do one off activities to make the math work, which wasn't sustainable (but worked super well up to $500k MRR).\n\nThey now divide growth into **strong-armed growth** and **evergreen growth** (growth that moves organic customers added per day, churn rate, or average revenue per customer).\n\n---\n\n# Questions\n\n**This seems to go against the advice of doing one thing well. How do you reconcile your one-off growth projects with that?**\n\nWe never found one strategy to grow that continued to work. There was no single channel we could focus on and still hit our numbers.\n\n**How many people did you have dedicated to growth at each stage?**\n\nIt was never smaller than 4 people. Right now our growth team is like its own mini company (even with its own engineers) - about 16.\n\n**Should I focus on growth or product first?**\n\nOnce you have some kind of product market fit, don't use product improvements as an excuse to not push on growth. You'll never feel ready enough.\n"
  },
  {
    "title": "Stop Aiming At Happiness: Uncommon Truths About What Really Fuels Retention",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/881974263984553984/Y7kRkDG7.jpg",
      "name": "Anna Jacobsen",
      "title": "Head of Customer Success + Onboarding, YouCanBook.me",
      "bioUrl": "https://www.microconf.com/growth/speakers/anna-jacobsen/",
      "twitter": "annagjacobsen",
      "website": null,
      "location": "Minneapolis, but CA is home",
      "description": "",
      "verified": false
    },
    "date": "2018-05-01 14:46:29 UTC-07:00",
    "conference": "growth",
    "description": "Prevailing wisdom says to make your customers happy. Is this true? In practice, you can make customers really happy and they still churn.",
    "image": "https://i.imgur.com/OFFvp4S.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1677163055665651%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/anna-jacobsen/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n# Anna Jacobsen\n\n* head of customer success & onboarding at [youcanbook.me](https://youcanbook.me) (calendly competitor)\n* head of customer success and lots of other things at Drip\n\n# Outline\n\n* old/new ways of thinking\n* data that shows better\n* 4 ways to take responsibility for your customer's success\n\n> Happy customers aren't loyal\n\n# Old/New ways of thinking\n\nPrevailing wisdom says to make your customers happy. Is this true?\n\nIn [The Effortless Experience](https://www.amazon.com/Effortless-Experience-Conquering-Battleground-Customer/dp/1591845815), making your customers happier makes them more loyal.\n\n![](https://i.imgur.com/AIs2P2o.png)\n\nBut in practice, you can make customers really happy and they still churn.\n\nOn the flip side, really angry customers that complain all the time in your support can stick around _forever_.\n\nWhy is this?\n\n## Why do unhappy couples stay together?\n\nWe stay in a relationship when something is **good enough**.\n\n![If you're getting a good enough experience, you'll stay for a long time even if the situation isn't ideal.](https://i.imgur.com/6f9oBws.png)\n\n> Once you’re consistently meeting the expectations of your customers, you're **already doing** the most economically viable thing you can do.\n\nThere's a difference between **meeting the needs of the customer** and **delighting the customer**. By meeting your customer's needs, you're already doing the most economically viable thing you can do.\n\n> Great products don't make successful customers.\n\n* Example 1: Docker went from 2,500 job postings in 2014 to 43,000 in 2015. Massive imbalance in supply/demand.\n* Example 2: Fender Guitars churn went from 40% to 90% over ten years\n* Example 3: Drip opened up a free plan after their acquisition. It drove growth, but got a completely different type of customer.\n\nIn all these examples, the company is great, but there's a problem with the customer.\n\nWhat did they do?\n\n* Docker: training program to get more people certified\n* Fender: $10/month guitar education app\n* Drip: instead of focusing on how to use Drip, Drip is focusing on teaching businesses the principles of marketing\n\nThese changes help users use the product more, use more features, and work more independently.\n\nThese are all metrics of **effective adoption**. Don't ask if your customer is happy, measure how\n\n> Just because someone uses your product does not mean they will be successful. They have to change their broken process, too.\n\nYou're the expert in the room - help your customer succeed!\n\n# 4 ways to take responsibility for your customer's success\n\n## 1. Coach, don't sell\n\nhttps://twitter.com/patio11/status/991438297997049856\n\nWhat does a sales person look like in your mind?\n\n![What does a sales person look like?](https://i.imgur.com/Ri6wp3H.jpg)\n\nThe most effective form of sales is to help people. Don't pitch your product with a slide deck, help your customer with their strategy to succeed.\n\n## 2. Plan your customer's success\n\nGood customer success plans measure ROI for the customer. Upselling/cross selling rate, rate of adoption, # of meetings, NPS, milestones achieved, and customer churned are all internal measurements that don't measure the core of how much you're actually helping your customer.\n\nEx: [MailClark](https://mailclark.ai/)\n\n## 3. Map processes to features\n\nSuccessful sales calls spend the call listening, and the very end of the call making recommendations.\n\n> When you map a process your customer already undertakes with a feature you provide, you’ll find an aha moment.\n\n## 4. Scale with success playbooks\n\n![](https://i.imgur.com/YSjVN9V.png)\n\n## Demo process at Drip (from Anna's 2016 atendee talk)\n\n![](https://i.imgur.com/iPW7e60.png)\n\nMost people would activate, but if not they fell into a Drip campaign\n\n![](https://i.imgur.com/0f90egT.png)\n\n![](https://i.imgur.com/R176gbm.png)\n\n# The Payoff: Renewal Time\n\nTypically, sometime before you charge a user you send the user an email letting them know they're going to get a bill.\n\nIf you get fancy, you might inject some dynamic stuff showing the user how much they used the product.\n\nThe unconventional way is to have a relationship with each customer and when it's time to renew, you **upsell them**. This upsell needs to be based in what the customer's need is.\n\n# Final Thoughts\n\n* happy customers still churn\n* our product probably isn't enough to get _all_ users to be successful\n* focus on the needs of your customer, not delighting them. Don't be afraid to say \"no\" to two-hour calls for a $10/month customer so you can be freer to help higher valued customers to achieve their goals.\n* Be judicious with high touch customer service. Reserve it for people that give you a lot of money.\n\n---\n\n(P.S. If you’re having trouble scheduling meetings with your prospects and customers, book Anna at [anna.youcanbook.me](https://anna.youcanbook.me))\n\n---\n\n# Questions\n\n**Do you have tips on getting users into demos and then converting customers?**\n\nLook at how much stickiness you introduce in the trial phase.\n\nFor demos: make it prominent in your site, include it in your emails, put it everywhere.\n\nFor converting: force education. Don't give users the option of not scheduling an onboarding session. Make it mandatory.\n"
  },
  {
    "title": "How My Weekly Podcast Runs Itself",
    "speaker": {
      "name": "Brian Casel",
      "twitter": "CasJam",
      "location": "Orange, CT",
      "description": "I write and teach at https://productizeandscale.com/ // I run https://audienceops.com/ // I co-host the http://bootstrappedweb.com/ podcast.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/964162706839187457/7Kxj-6V6.jpg",
      "website": "http://productizeandscale.com"
    },
    "date": "2018-04-30 16:17:34 UTC-07:00",
    "conference": "growth",
    "description": "With every project Brian starts, he asks how can I sustain this after I stop working on it?",
    "image": "https://i.imgur.com/bKY95Ta.jpg",
    "isPublic": true,
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/brian-casel/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n~64.35% of Brian's customers came from hearing me on a podcast: either [Bootstrapped Web](http://bootstrappedweb.com/) or [Productize Podcast](http://productizepodcast.com/).\n\nWith every project Brian starts, he asks \"how can I sustain this after I stop working on it?\"\n\n> When I move onto whatever the next thing is, I want my businesses to sustain themselves.\n\nFor a podcast, Brian really only wants to be interviewing interesting people, not:\n\n* finding interesting people to interview\n* researching interesting people\n* handling inviting people and scheduling\n* audio editing and mixing\n* writing show notes with links and transcriptions\n* designing a featured image\n* uploading and publishing in WordPress\n* sending new episodes to my email list\n* posting new episodes to my social media accounts\n* emailing the guest their published episode\n* report on listener stats and trends\n\nThis stuff needs to get done, so Brian set up a process to get them done automatically.\n\nAs an example, here's what that process looks like for finding interesting guests:\n\n1.  Manually find the first few guests\n2.  List places where interesting guests can be found (like other podcasts, communities, customers, etc.)\n3.  Producer/editor suggests potential guests from those places in a gravity form with a brief (website, point of interest, other interviews)\n4.  Brian approves or denies the suggestion with a reason why (so the process can be improved)\n5.  Producer invites the guest\n6.  Guest books on Brian's calendar\n\nAudience Ops is starting up [a new service for podcasting](https://audienceops.com/podcasting/) that does this process for you.\n"
  },
  {
    "title": "When and How to Acquire and Invest Capital into Your SaaS Business",
    "speaker": {
      "name": "Brian Parks, CFA",
      "twitter": "ParksTweet",
      "location": "Denver, CO",
      "description": "SaaS and Crystal Palace supporter, https://t.co/D9pObfCJSY\n@bigfootcapital",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/846169590887473152/XrSZE9wv.jpg",
      "website": "http://www.bigfootcap.com"
    },
    "date": "2018-05-01 11:52:22 UTC-07:00",
    "conference": "growth",
    "description": "Microconf 2018 talk recap",
    "image": "https://i.imgur.com/9s2LyHS.jpg",
    "isPublic": true,
    "facebookStream": "https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fteamlanio%2Fvideos%2F1676996419015648%2F&show_text=0&width=560",
    "body": "\nCheck out [Bigfoot Capital's Growth Edition Giveaways](https://www.bigfootcap.com/microconf-growth-edition-giveaways/)\n\nbigfootcap.com/microconf - claim one of 48 service packages\n\n> Bigfoot Capital is a front company for making funny cat tshirts\n\n## Brian's career\n\n* 2006-2010: mergers and acquisitions, selling companies, no real personal risk (investment banking, just like Jeff Bezos!). Used money from Private equity, corporate, debt fund and bank financing.\n* 2010-2016: early-stage companies, $5M raised, 1 done, 1 doing well, 2 we’ll see. Used money from Friends and family, angel, venture capital.\n* 2017-Now: Bigfoot Capital to capitalize early-stage software companies (4 so far). Used money from HNW (accredited investors) and family offices as my investors.\n\n> I feel like I’ve spent a lot of time around other people’s money. No matter the type of investor, they're all afraid of underperforming.\n\nWhile these investors are all different in terms of how they do it, all investors are just people with a common fear: **underperforming**.\n\nTo overcome this primal fear, investors need **comfort**.\n\nHow do you give investors comfort early on in the process so they invest?\n\n> How you go about raising money can be an indicator for how you run the rest of your business, and thus for how good of an investment you may end up being.\n\n---\n\n# 6 pitfalls to avoid  when raising money\n\n## Pitfall #1: Casually Raising Money\n\nYou're not really raising money if you're doing it casually.\n\nIf you're not keeping in contact with your investors, they'll question your commitment.\n\nIf you're not putting your investors to work, they'll lose the inclination to help.\n\n## Pitfall #2:  Having poor timing\n\nDon't go out for funding too early or you'll have to prove more faster.\n\nDon't wait too long to get funding or the walls will be closing in.\n\n## Pitfall #3: Going after the wrong audience\n\nBigfoot has a scoped-down list. If your list is too big, it's unfocused and your investors will question your targeting ability. Target around 30 investors.\n\n## Pitfall #4 : Having Unreal Expectations\n\nIf your investor list is too small (like 2 people), you need to broaden your scope.\n\nIf your investment window is too small, you'll lose steam.\n\nIf you overestimate your value, you'll shrink your market and turn groups off.\n\n## Pitfall #5 : Overoptimizing\n\nOveroptimizing feels like death by a thousand cuts.\n\nIf you're constantly renegotiating, good faith goes down the drain.\n\nIf you're overemphasizing edge cases, your judgement will be called into question.\n\nIf you can't get comfortable, your investors will start doubting their investment late in the game.\n\n## Pitfall #6:  Not thinking ahead\n\nIt’s easy to jeopardize future capital raises\n\nIf you only do what's comfortable, you'll get lazy and pay less attention. If you lock yourself by taking financing, you reduce optionality of taking future capital.\n\n# Recap\n\nRaising capital is basically sales. If sales isn’t your thing, find help.\n\nYou have processes for other parts of your business, so have one here.\n\nInvestors are skeptical. Use the process to reduce their doubt.\n\nBrian is happy to chat more about any of this\n[calendly.com/bigfoot](https://calendly.com/bigfoot) or [bparks@bigfootcap.com](mailto:bparks@bigfootcap.com)\n"
  },
  {
    "title": "Everything You've Learned at MicroConf is Wrong*",
    "speaker": {
      "name": "Chad DeShon",
      "twitter": "chaddeshon",
      "location": "",
      "description": "Software Engineer. Royals Fan. Board gamer. @RoyalsUmp",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/2163792831/bluewaldo.png",
      "website": "http://www.BoardGameTables.com"
    },
    "date": "2018-05-01 11:39:48 UTC-07:00",
    "conference": "growth",
    "description": "Microconf 2018 talk recap",
    "image": "https://i.imgur.com/9dCVBPj.jpg",
    "isPublic": true,
    "facebookStream": "https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fteamlanio%2Fvideos%2F1676996419015648%2F&show_text=0&width=560",
    "body": "\nChad did the Microconf thing - B2B SaaS, charging more, taking sales calls with Fortune 500 companies - and it totally worked.\n\nThen he decided to sell BromBone and go back to what he knew: a side project moving downmarket to selling physical boardgame tables.\n\n![BoardGameTables.com](https://i.imgur.com/9dCVBPj.jpg)\n\nBoardGameTables.com sells high end custom tables for an average of $3,500. Their June 2016 Kickstarter raised **$2.6M**.\n\nThis is the anti-microconf business. Here's what workes well in BoardGameTables that goes against Microconf wisdom.\n\n## 1. Recurring Revenue is Overrated\n\nEven though selling board game tables doesn't generate recurring revenue (`growth_rate == churn_rate`), the business still works.\n\nThere are a lot of perks to the one time sales model, though. One time sales mean you get your customer's Lifetime Value (LTV) up front.\n\n> If my LTV is higher than my Cost to Acquire a Customer and the cost to give that customer what they ordered then I make profit.\n\nBad: Income Delayed\nBad: Harder Sale\nGood: Can Increase LTV by Lowering Churn or Adding Expansion Revenue\n\nCan you get both recurring revenue and get all the revenue up front? No, those are literally opposite.\n\n## 2. Annual Plans Are Overrated\n\nWhen Chad sold BromBone, he used FE International as a broker. And they had all these questions about my annual plans.\n\nIt's easy to mask churn problems, but you should fix them instead. A customer is churned when they stop using your product, not when they stop paying.\n\n> A customer is churned when they stop using your product, not when they stop paying.\n\nSometimes there are customers who are destined to churn.\n\nFor example, sometimes BromBone would lose a customer because they went out of business.\n\nYou can’t really fix that. So, maybe it is a good idea to try to collect as much as you can upfront.\n\nBut Chard argues that you’re still missing the point. Your path to growth isn’t maximizing your revenue from bad customers. Maximize for your good customers.\n\nOf course, there are reason to have annual plans\n\nJust make sure you are doing it because they are right for your business and not because you are copying what everyone else is doing.\n\nIf you aren’t restrained by cashflow, then I would give serious pause before offering much of a discount for annual plans.\n\n## 3. It is Possible to Move Down Market\n\nMoving down market is different than charging less.\n\nWhen Chad launched his Kickstarter for a new model of table, the table was clearly differentiated (that’s business speak for it’s not as good). It opened up new customers who were NEVER going to buy the more expensive product.\n\nThe high end tables lost some sales to cannibalization, but they also gained some because of greater brand awareness.\n\nThe process has been super hard.\n\nIf this were MicroConf Starter, Chad would just say no. Don’t do it.\n\nBut since this is growth, he believes it is possible, just:\n\n* Make sure the product is different\n* Make sure you are going to reach audience that is both NEW and LARGER.\n* Be ready to work.\n\n## 4. Overrated: B2B = Just Show Positive ROI\n\nA big reason that people recommend starting a B2B business is that if you just show a positive ROI to customers then businesses will buy from you.\n\nAfterall, that is what businesses do. If they can give you $1000 and it makes them $2000, then it is a no brainer.\n\nThe great thing about B2C is that you don’t have to show a positive ROI.\n\nIt can be tricky to prove that positive ROI in practice.\n\nThere are setup expenses, opportunity costs, attribution problems (was that new revenue really because we are using your product, or would we have gotten the sale anyway)\n\nThere are unknowns. You just can’t account for everything\n\nWith B2C you just have to make them want it.\n\n> When B2C, you just have to make them want it. Is your product pretty? Are cool kids using it? Can they brag about it? It doesn't have to be logical.\n\n## 5. Listen to Podcasts at 1x\n\nSeriously. You don’t have to cram information into your ears as fast as possible. Take a deep breath and relax. Use the slower speed to allow your mind to wonder. To have its own ideas and go on its own tangents. It will be ok.\n\nchad@boardgametables.com\n"
  },
  {
    "title": "How to Conduct a Great User Interview",
    "speaker": {
      "name": "Chris Achard",
      "twitter": "NanoHopDev",
      "location": "Carmel, IN",
      "description": "Software developer. CEO/Founder of NanoHop",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/976108400428789761/Vt54tYdw.jpg",
      "website": "http://nanohop.com"
    },
    "date": "2018-05-02 14:11:52 UTC-07:00",
    "conference": "starter",
    "description": "Microconf 2018 talk recap",
    "image": "https://i.imgur.com/WRKsvYe.png",
    "isPublic": true,
    "isAttendee": true,
    "body": "\nWhat is the Goal?\n\n* Validate an idea? Try flipping that to invalidating your idea.\n* Learn and adapt\n* Find product / market fit\n\nProduct / Market Fit\n\n* It is not just interest\n* True test is $$, but that's hard to get in the beginning\n* Look for a switch from you pushing to them pulling\n* See the user imagining their life with the product, and planning for it. That's a great sign.\n\nThings to Test and Adjust\n\n* Problem: what you're trying to solve.\n* Product: what you build to address it\n* Market: who you're selling it to, price point, the person you're selling to vs. person using it\n* Wording: use words your customers use.\n\nFinding People to Talk To\n\n* Your current network - don't ignore this! Just casually talk to friend about what you're trying to do. Does your uncle own a business in the space? Talk to them!\n* Become a visible expert in the space. Long term but great strategy. Meetups and blogs make it easier to find people.\n* Conferences / events / meetups. These are good, but make sure they're the places your users go to learn new things (\"watering holes\")\n* Cold emails. Keep it short and make it easy to respond. You can also find a way to personally connect, which increases the response rate (\"I'm also in Indy!\"), then **follow up**! \"Did you get my last email?\" => \"oh yeah, I meant to respond but I was busy\"\n\nConducting the Interview\n\n* In person > video > phone > email. Email is fine for a simple single response, but you get a lot of value from seeing a person's face.\n* Ask to record. It's going to go fast. Focus on engaging the person instead of collecting information.\n\nWhat NOT to Do\n\n* Don’t talk very much\n* Don’t put ideas in their heads. Try to get their wording.\n* Don’t describe your solution. This is hard. You can mention it at the end, but if you mention it too early you'll muddle up their words.\n* Don’t ask what they want. People don't know what they want!\n* Don't ask yes or no questions - \"does that sound like a good solution?\" cuts off information too soon. Change it to something like \"How does that problem rank among your day to day priorities\", or \"why might that work or not work for your business?\" \"Who are two or three other people who might be interested to talk about this?\" is harder not to answer than \"Do you know anyone else I could talk to?\"\n\nWhat to Ask About\n\n* Factual questions\n* Past behavior\n* How things operate now\n* What they don’t want\n* What they see others doing. The aspirational question! What do you want to be doing? These are words you can use in your marketing.\n\nDig In Deeper\n\n* Understand why. Ask “Interesting - tell me more about that.”, “... how does that work?”, “Describe how...”, “What was a time when...”. Get them talking about their process and try to understand why they operate.\n\nCompeting Products\n\n* Don’t despair - that’s good! Super valuable information\n* Ask what they like\n* Ask what they don’t like\n* “What would it take for you to switch?” This is a great question to mine for marketing language.\n\nAsk for Referrals. If you don't get one right away, say \"that's alright, I'll follow up in a few days\"\n\n* Warm leads respond MUCH better than cold leads. 5-10x better.\n* Doesn’t have to be on the call - say you’ll email later to ask\n* Can ask for an intro email\n\nAfter the Interview\n\n* Follow up! Prepare them with a “I’ll definitely let you know when I have more to show you.”\n* Make changes. There's no point to the interviews if you're not making any changes.\n* Do more interviews until you stop learning new things. Everyone wants a number - it's going to be different from market to market. 10 is easy to remember, but you actually want to keep going until you stop learning. Also, do interviews again after a few months! Maybe the market changed, maybe you have a bigger audience.\n\nCheck out [How to Run a User Interview](https://www.youtube.com/watch?v=qAws7eXItMk) and [How to Find Product Market Fit](https://www.youtube.com/watch?v=_6pl5GG8RQ4)\n\n[Download Chris's slides](http://nanohop.com/mc18.pdf), and [email him](https://chris@nanohop.com) if you can't figure out who to email. He'll even write your emails for you 😲\n"
  },
  {
    "title": "How To Use Jobs To Be Done To Perfect Your Positioning",
    "speaker": {
      "name": "Claire Suellentrop",
      "twitter": "ClaireSuellen",
      "location": "Atlanta + The Internet",
      "description": "For SaaS marketers, I run https://forgetthefunnel.com/ w @ggiiaa // For self-funded SaaS founders, Co-founder https://userlist.io/.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/955222153716215808/AnCUHdcb.jpg",
      "website": "http://loveyourcustomers.co",
      "title": "Head of Marketing, Userlist.io",
      "bioUrl": "https://www.microconf.com/growth/speakers/claire-suellentrop/"
    },
    "date": "2018-05-01 15:54:02 UTC-07:00",
    "conference": "growth",
    "description": "When marketing a product, it's common for founders to focus on the product itself. 'Look at our cool features! We help you do XYZ activity, but better!' This is a recipe for getting lost in the noise, and for losing to competitors with deeper pockets.",
    "image": "https://i.imgur.com/CQeRqWO.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1677206125661344%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/claire-suellentrop/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n[userlist.io/microconf](https://userlist.io/microconf)\n\nWhen marketing a product, it’s common for founders to focus on the product itself. “Look at our cool features! We help you do XYZ activity, but better!” This is a recipe for getting lost in the noise, and for losing to competitors with deeper pockets.\n\nInstead, capturing your customer’s attention requires focusing on her ultimate motivation (“job to be done”), which is to transform her current life-situation into a preferred one.\n\nAfter this talk, you’ll walk away with:\n\n– An understanding of the “jobs to be done” theory\n– An understanding of how JTBD helps companies create effective positioning\n– A proven, step-by-step process for uncovering your customer’s ultimate motivation (“job to be done”)\n\n![Have you ever described your product like this? It's fine, just don't rely on them day-in day-out to differentiate your product](https://i.imgur.com/4LCHoMl.png)\n\nYour customers do want to be saving time. They probably also want to save money, but you need to **get more specific**.\n\n![How do appointment scheduling tools describe themselves?](https://i.imgur.com/oSwga9E.jpg)\n\nAppointment scheduling tools describe themselves very generically: \"powerful system\", \"robust feature set\", \"save time\", and \"easy-to-use\".\n\nThere's a big problem with these generic descriptions: **They're abstract**: you wouldn't sell groceries as individual ingredients, you'd **sell the cake**. To capture people's imagination, you need to **get specific and vivid**. This is way more important if you're on a crowded market.\n\n## YNAB Example\n\n![YNAB made a feature change that made it much harder to keep track of overspending, which is super stressful](https://i.imgur.com/vTPRR7J.jpg)\n\nWhat should Claire do? What product should she switch to that will solve the pain point of this one feature breaking?\n\n**\"Ready to take control of your finances?\"** - well, no, I'm looking for a solution to solve this pain from YNAB\n\n**\"Take control of your finances with Quicken\"** - uhh these all sound the same\n\n![Products with generic swappable headlines are like Zebras fading into eachother](https://i.imgur.com/ywrb1OB.jpg)\n\n## Jobs to Be Done\n\n> Jobs To Be Done is the theory that p ople buy and use a product because they want to make themselves better in particular ways\n\n[Coffee and Kale](https://www.amazon.com/Kale-Coffee-Renegades-Happiness-Longevity/dp/1401946186) talks more about Jobs to be Done.\n\nJob story: When **\\_**, help me **\\_**, so I can **\\_\\_**.\n\n![Job story: when _, help me _, so I can _ ](https://i.imgur.com/k9UXpGQ.png)\n\nFor this YNAB example:\n\n* **When** my partner has made work-related purchases, and we know we'll be reimbursed for those purchases at the end of the quarter...\n* **Give me** the flexibility to separate those purchases from the rest of our spending...\n* **So I can** plan next month's budget _without_ the stress of creating easy-to-screw-up workarounds.\n\nIs this an edge case? Not according to Reddit's community:\n\n![](https://i.imgur.com/ZQQxCYl.jpg)\n\n![](https://i.imgur.com/7uCoTAO.jpg)\n\n![](https://i.imgur.com/GeL4gFB.jpg)\n\n![](https://i.imgur.com/G9NPXjq.jpg)\n\nPeople are not happy with YNAB. If you were a competitor, think of how effective it would be to take these words and use them on your landing page!\n\nInstead of \"Ready to take control of your finances?\", try \"The only way to fully customize the way you manage your money painlessly.\"\n\n![This copy change had a 200% increase in conversions from the homepage to the pricing page](https://i.imgur.com/Km5O4z4.jpg)\n\nHow do you figure out the job your product does for your customers? Getting a handful of customers on the phone (customer interviews) can color in any gaps leftover from traditional surveys.\n\n## Tactics\n\nGet templates of these survey and interview templates at [userlist.io/microconf](https://userlist.io/microconf).\n\nSurveys:\n\n* build a short (~5 questions) survey (Typeform makes it easy to include hidden fields) from [a template](https://userlist.io/microconf)\n* identify 1-200 of your most high-value customers\n* email them the survey from a real person (but hold back about 40 customers to use for interviews later)\n* aim for 25-50 results\n\nInterviews:\n\n![Your interviews provide extra context](https://i.imgur.com/pRZTFbt.png)\n\n* Invite the held-back 40 high-value customers to a 30-minute interview with a link to schedule. People love getting on this call and talking about themselves! You'll probably get a ~20% success rate.\n* Aim for 10 interviews.\n* Don't ask people what they think of your new features (people are bad at answering questions like that). Try to get an idea of why they did decisions in the past. \"What did your life look like before our product? What happend that led you to start seeking something like our product? Once you found us, what made you sign up for the trial?\"\n* Record these calls - raw language is amazing for copy and developing stronger positioning. You'll use this to mirror your customer's language back at them. You can use [Rev.com](https://rev.com) to transcribe them for $1/minute.\n\nNow you'll have a lot of data to start building a Jobs to be Done story, and you can do it in your customer's language.\n\n![You'll start seeing patterns in survey results](https://i.imgur.com/5hI2YoU.png)\n\n![When you have your own customer's words, writing copy is trivial](https://i.imgur.com/JUK1wFT.jpg)\n\n---\n\n# Questions\n\n**What do you do when you have a lot of verticals you're targeting? Landing pages?**\n\nYour homepage is like an Airport: some people want pricing, some want jobs, some want to contact support.\n\nLanding pages is a great move. [Buffer](https://buffer.com/) also used to have two browser tabs to segment agency owners vs. business owners. If people can self-select on their homepage you can speak to people more strongly.\n\n_Note from Christian: Also check out [Right Message](https://rightmessage.com/)._\n\n**When choosing the high value customers, should you let them settle into your product?**\n\nAim for the people who have been in the product for a while. Rule of thumb is 6 months, but it depends on what onboarding means for your product.\n"
  },
  {
    "title": "Navigating the Startup Landscape",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/892897123967971328/5KaloE83.jpg",
      "name": "Courtland Allen",
      "title": "Indie Hacker, Stripe",
      "bioUrl": "http://www.microconf.com/starter/speakers/courtland-allen/",
      "twitter": "csallen",
      "website": "http://www.IndieHackers.com",
      "location": "San Francisco",
      "description": "MIT 09 🏛 YC 11 🚀 developer 💻 designer 🎨 avid reader 📚 casual traveler ✈️ StarCraft fan 👾 @IndieHackers at @stripe ⚡",
      "verified": true
    },
    "date": "2018-05-03 16:46:48 UTC-07:00",
    "conference": "starter",
    "description": "Inspire people to create internet businesses and to help these new founders succeed at a scale large enough to have a global impact.",
    "image": "https://i.imgur.com/3pxXk2L.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1679433578771932%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\nhttps://twitter.com/mijustin/status/988984477081718784\n\nIndie Hackers is a community for founders.\n\n![Courtland has done over 300 interviews with founders. Most of them are success stories, but every one of these founders failed](https://i.imgur.com/bCo4pCc.png)\n\nAs founders failed, they learned things.\n\nThis talk will help you skip a few steps so you don't have to fail as much. See the world like these experienced founders do.\n\n![Four different startup landscapes. Each is a metaphor for a phase of your startup](https://i.imgur.com/m3LmNCM.png)\n\n# 1. The Startup Runway\n\n![The startup runway of almost certain death](https://i.imgur.com/DGqVXk0.jpg)\n\nRunway is how long you have left until your business is dead. How do you navigate it? Just become cashflow positive before you run out of money.\n\nHow? The same way a pilot takes off a plane: know your plane's metrics, have your eyes at the end of the runway, and make sure you're prepared for takeoff.\n\nThis isn't how it always works out though.\n\n## Exhibit 1: Courtland won a business competition!\n\n![](https://i.imgur.com/eURV7VU.png)\n\n![Courtland spent his time working on product, refactoring, unit tests, landing pages, new features, design, and then launched. He did everything except charging money to a customer. You should charge money for your product.](https://i.imgur.com/8k0FdF1.png)\n\nWhen was the last time you calculated your runway? Calculate how much you have left in the bank.\n\n## Exhibit 2: Chris Chen of Instapainting (YC company)\n\n![](https://i.imgur.com/SGX8bLH.png)\n\n\"I survived on my various ideas and pivots for about three years. I just spent an absurdly long time pivoting...\"\n\n\"...but as I ran lower and lower on cash, my ideas would start focusing less and less on building social music apps, and more on how to generate revenue immediately.\"\n\n\"And then I ran out of all my cash. I was $4,000 in debt, so I had to put up the website for my last idea to collect money. I created, tested, and launched it in just a couple days...\"\n\n\"...I put the page up on Reddit, and in two weeks I'd made over $2,000 in sales.\"\n\nAfter three years pivoting, he made a successful product in two weeks!\n\n## Exhibit 3: Max Lytvyn of Grammarly\n\n![](https://i.imgur.com/a793MFu.png)\n\n\"\\[It took less than six months to profitability\\]. It was very quick. It was very quick because we had really solid plan on how to get there.\"\n\n\"We didn’t know who was going to buy... so we tried to sell to institutions, to organizations, and individuals at the same time to see what works better.\"\n\n\"By the time we finished building version one, we had a pipeline of organizational buyers lined up.\"\n\nHow'd Max get there so fast?\n\n\"Necessity. We realized that building this product would be really hard and really expensive, so by the time we were done with the MVP, we’d probably be out of money.\"\n\nHere's a secret, though. You don't have to navigate the runway of certain death! You can use a helicopter! 🚁\n\n![If you don't want to burn through cash on the runway of death, don't quit your job!](https://i.imgur.com/uUDSpe1.jpg)\n\n\"But Courtland - I can't start a startup while running my main job! I need the runway of certain death!\" - no\n\n![The helicopter pad of certain slow success uses the same skillset as the runway of certain death](https://i.imgur.com/uaN9QEx.png)\n\n# Landscape 2: The El Dorado of Ideas\n\n![](https://i.imgur.com/UaH6hG3.jpg)\n\n![Some of his ideas were bad, and the good ones people were already working on. Too bad you can't force ideas... or can you?](https://i.imgur.com/bNxQHXX.png)\n\n![Part of running a business is constantly working on ideas.](https://i.imgur.com/yTJvDsN.png)\n\nhttps://twitter.com/csallen/status/979860753103507456\n\n![The El Dorado of Ideas. What does it mean to come up with ideas that are so obvious someone else has already thought of them?](https://i.imgur.com/AQvGo8T.jpg)\n\nWhile you're living your daily life, the chance of stumbling on gold nobody else has stumbled on is very low. It's not a great strategy for ideas.\n\n![Don't dig a lot of shallow holes - like making 100 landing pages a year - to find good ideas. Dig deep! Get your hands dirty!](https://i.imgur.com/MmM5ESK.png)\n\nDigging deep means asking questions like:\n\n* Who are these people?\n* Where do they hang out?\n* What do they complain about?\n* What makes them really excited?\n* What do they buy? What do they never buy?\n* Who do they follow, trust, and respect?\n* What do they fear?\n* What are their goals?\n* Where do they get their product recommendations?\n* What do they read, watch, or listen to?\n* What makes them angry?\n* etc.\n\nYou'll start finding ideas nobody else has found.\n\nWhat if you have a new idea? Dig deep again! Don't build your house over what you _think_ is a goldmine.\n\n> Successful multibillion dollar companies like Stripe don't use their intuition - they talk to customers a lot.\n\nAlso check out Amy Hoy's [Stacking the Bricks](https://stackingthebricks.com/), specifically her Sales Safari technique.\n\n![What if you have a new idea? Dig deep again! Don't build your house over what you _think_ is a goldmine without proof](https://i.imgur.com/q3p00W9.png)\n\n* How much money is changing hands here? Are the customers reachable?\n* How long would it take to launch a product? What are your weaknesses?\n* What's your runway like?\n* Would you like your customers?\n* What are your personal goals?\n* What industry would make you happy? etc.\n\n# Landscape 3: The Climbing Wall of Growth\n\n![Most beginner founders think growth happens explosively, then it's smooth sailing to the top.](https://i.imgur.com/XrPRbta.png)\n\n![There's a lot of corroborating evidence for a single event triggering smooth sailing of exponential growth, but it's not true ](https://i.imgur.com/DocjfRT.png)\n\nMaybe one out of a million company has a growth hack, but it won't be your company.\n\nThere is no magical viral growth step at the bottom of the climbing wall that launches you to the top. It's hard. Every step takes effort and attention. If you stop climbing, you stop progressing.\n\n![Growth is a slog, like climbing a wall](https://i.imgur.com/LRXyRau.jpg)\n\n![Behind graphs up and to the right are a lot of hidden forces](https://i.imgur.com/e8PWSgZ.jpg)\n\n![](https://i.imgur.com/DXGWz2C.jpg)\n\n![IndieHacker readers complained that Jason had it too easy because he already had a successful blog](https://i.imgur.com/yorJlIQ.jpg)\n\nThis growth wasn't as easy as it looked. It was a long hard slow slog:\n\n\"I hand tailored more than 1,000 emails to blogs. It took me five months of doing it every day. They didn't respond, so I would tweet them, I would Facebook message them, I'd send SoundCloud messages, I'd send another email. Then I'd try and find another contact. And we're still sort of doing this today. Those 250 blogs and labels didn't come overnight.\"\n\n![The first step is the simplest. You don't need a brilliant strategy early on.](https://i.imgur.com/tvKuoSg.jpg)\n\nIt's okay that you started small. Now there are new steps that are easier to reach.\n\nKeep climbing! Nobody else jumped straight to the top. You'll never find new steps unless you try.\n\nPlan your route. See what paths others took. Look multiple steps ahead. Steps like starting a mailing list make it much easier later on.\n\nStay on track to your destination. The higher you climb, the more distracting options. Having a clear vision makes it easy to say \"no\" to things that don't get you closer.\n\n# Landscape 4: Vision\n\n![\"Create a vision\" probably makes you think of cheesy corporate stock photos](https://i.imgur.com/sQx4fAK.jpg)\n\n> The number one reason your business could die is that you'll quit.\n\nAvoid quitting with confidence.\n\n![If you knew Courtland lost a multimillion dollar diamond in his apartment, how long would you spend looking for it?](https://i.imgur.com/XDZ9rsw.jpg)\n\nIf Courtland said there may or may not be a multimillion dollar diamond in his apartment, you'd probably give up a lot easier. You're much less confident in the outcome, so _of course_ you'll give up when the going gets tough.\n\n> \"Inspire people to create internet businesses and to help these new founders succeed at a scale large enough to have a global impact.\"\n\n---\n\n# Questions\n\n**Apart from content marketing, are there others ways to get early traction?**\n\nIt depends a lot on your target customers. Everyone knows about the default places to launch (HN, product hunt).\n\nIs your audience indie game developers? Spend a lot of time with them. Learn what influencers they care about, where they hang out online (watering holes), and where they get their news.\n"
  },
  {
    "title": "SEO Tasks That Produce Results",
    "speaker": {
      "email": "mail@softwarepromotions.com",
      "name": "Dave Collins",
      "twitter": "TheDaveCollins",
      "location": "New Milton, England",
      "description": "Making the web more sarcastic since 1997. Slightly aged father of two amazing lunatics. I specialise in SEO, web-sorcery and occasional compulsive lies.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/841929541492854784/0bxTZMfZ.jpg",
      "website": "https://www.softwarepromotions.com/",
      "title": "Founder, Software Promotions",
      "bioUrl": "https://www.microconf.com/growth/speakers/dave-collins/"
    },
    "date": "2018-04-30 11:26:27 UTC-07:00",
    "conference": "growth",
    "description": "As a founder of a bootstrapped business, you don’t have time for SEO. I get that. Your competition would celebrate this, but they’re also too busy doing the wrong things. I'm going to show you why SEO as you know it is dead, how to use SEO signals to your advantage, and more than 20 different ways to tap into Google's traffic with minimum effort and time investment. The focus of this talk will be on practical steps that every busy business owner can and should adopt to get more new customers without spending a penny.",
    "image": "https://i.imgur.com/L79ZWF7.png",
    "isPublic": true,
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/dave-collins/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\nCheck out [Dave's summary of his talk](https://www.softwarepromotions.com/microconf-2018-resources-dave-collins/) - you can also schedule a call with him!\n\n---\n\nUsual SEO Formula:\n\n```\nboring + non-urgent + time consuming\n+ unlikely to work + might even blow up in your face\n= never going to happen\n```\n\n# Dave Collins\n\nDave has worked on SEO for over 20 years!\n\n## _But Dave, I've tried SEO and it doesn't work, so it's clearly dead_\n\nSEO isn't dead, you're just doing it wrong. Not paying attention to SEO will kill your business.\n\n<!-- TODO: organic search results slide -->\n\n> SEO isn't dead, you're just doing it wrong.\n\nPeople like to point to ads on google search results and say search results are all about paid ads, but most google real estate is actually there for organic results.\n\n> Put the seeds somewhere dark and moist ;)\n\n## Googling Experiment\n\nCan you imagine if users had to pay $0.05 per google search? Let's see how well google does with different levels of searching:\n\n* ✅ Level 0: dog\n* ✅ Level 1: jack russell\n* ✅ Level 2: jack russel smiling\n* 👎 Level 3: black and white jack russel smiling (google starts to slip here)\n* 🚫 Level 4: black and white jack russel smiling next to a baby (google doesn't know what it's doing)\n\nOnce searches get past Google's level of expertise (~level 3), the results start slipping.\n\n### Exercise 2: Find \"Dave Collins\"\n\nDespite google's claim of returning images that are visually similar, it's actually all about text.\n\nThe fore fundamentals of SEO haven't changed at all in the last 20 years. Google needs our help - it's a partnership.\n\n> Google needs our help.\n\n---\n\n# SEO Action Plan\n\n## Task 1: Low Hanging Fruit\n\nHow will google feel about bland meaningless copy, like \"websites are becoming more and more common every day\"? Bleh.\n\nHere's the low hanging fruit.\n\n> \"Low hanging fruit,\" as you Americans like to say. Low hanging fruit? Low hanging fruit.\n\n[Google Search Console](https://search.google.com/search-console) has four important parts you should be checking on a regular basis:\n\n1.  Crawl Errors: anything google finds that causes a problem, like a 404. This is bad for google and you.\n2.  HTML improvements: massively underestimated. Highlighted in [Google's search engine optimization starter guide](https://support.google.com/webmasters/answer/7451184?hl=en)\n3.  Index Status: select all the boxes and make sure everything makes sense.\n4.  Security issues: should always read \"we haven't detected any security issues with your site's content\". If not, stop everything and fix it.\n\n## Task 2: Keywords\n\n1.  How would your friend describe your page?\n2.  Run these phrases through google - would your page make sense in this context?\n3.  Use your imagination!\n\nIf you were looking for microconf, would you search for \"conference for startups\", \"entrepreneurial conference\", or \"entrepreneur conference\"?\n\nTurns out \"entrepreneurial conference\" has the highest search volume!\n\nHere's another example:\n\n* seo service (1x)\n* **seo services (6x)**\n* seo training\n* seo is dead\n\nYou have to use the tools, don't just guess what you think the most popular keywords are.\n\n> People click on more compelling titles\n\n## Task 3: More compelling content\n\nIf you have more than 10-15 pages of content, you don't need to write new content purely for SEO. It's more about making better use of what you have.\n\nTODO: see low hanging fruit in spreadsheet?\n\nWhat do people also ask? Reflect these ideas back at google!\n\n![What do people also ask? Reflect these ideas back at google!](https://i.imgur.com/foA2Lms.png)\n\nSee the world as google sees it. You can also use tools like [ahrefs](https://ahrefs.com/).\n\nGet into the minds of the people searching. Look at the pain points, ideas, and themes of people searching for your stuff.\n\n## Task 4: Use the Right Tools Correctly\n\n* [Keyword Planner](https://adwords.google.com/home/tools/keyword-planner/#?modal_active=none): useless from an SEO perspective\n* [Search Console](https://search.google.com/search-console): more data than most paid SEO tools (this is free)\n* [ahrefs](https://ahrefs.com/): 7-day trial for $7\n* [Screamingfrog](https://www.screamingfrog.co.uk/seo-spider/)\n* [Sitebulb](https://sitebulb.com/)\n* [urlprofiler](https://urlprofiler.com/)\n\nThese tools wont' do the work for you, though\n\n## Task 5: Feed the mobile index\n\nGoogle is moving to mobile-first indexing. Your index will be based on the mobile version of your website.\n\n[Rolling out mobile-first indexing](https://webmasters.googleblog.com/2018/03/rolling-out-mobile-first-indexing.html) has quadrouple speak, but basically says Google will care a lot more about mobile indexes.\n\nResponsive is not mobile-friendly. Check if your site is actually mobile friendly with Google's [Mobile-Friendly Test](https://search.google.com/test/mobile-friendly)\n\n## Bonus Tip\n\n> Golden Rule: Put humans before spiders. Always\n\nIf you click on a website and get a page with a bunch of SEO nonsense, you're going to bounce, which is a super strong indicator your site sucks.\n\n## 7 Rules of SEO\n\n1.  Don't talk about SEO\n2.  Fix the machine: don't just look good, work well\n3.  Invest time in keywords\n4.  A different approach to content\n5.  Use the right tools\n6.  Embrace mobile first ([check your website](https://search.google.com/test/mobile-friendly)). If you pass, Dave will let you buy him a drink.\n7.  Humans before spiders.\n\nEvery once in a while, one of these seeds will fall in the right place and build something amazing.\n\n---\n\n# Questions\n\n**When google gets a 404 on one of your page, how do you tell it it's gone?**\n\nRedirect it to the closest fit or use `robots.txt` to block it.\n\n**Look for high impressions and low clicks?**\n\nYes.\n"
  },
  {
    "title": "The Case Against Growth",
    "speaker": {
      "name": "Dave Kiss",
      "twitter": "davekiss",
      "location": "Cleveland, OH",
      "description": "Making stuff for the internet and sharing what I learn along the way. @vimeography @aceblocks @createinternet",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/988418664268484609/4bgbBdxj.jpg",
      "website": "https://davekiss.com"
    },
    "date": "2018-04-30 15:53:26 UTC-07:00",
    "conference": "growth",
    "description": "The best way to build something sustainable is to maximize yourself.",
    "image": "https://i.imgur.com/zo1DOAT.png",
    "isPublic": true,
    "body": "\nDave's main product is a Wordpress Plugin, [Vimeography](https://vimeography.com/).\n\n## 1. Redefine Growth\n\nRethink what you think you know about growth; it's not necessarily about getting bigger.\n\n> Growth doesn't just mean getting bigger - that's only a half definition. Growth for you might mean getting smaller: less customers, less employees.\n\nDave's idea of growth is closer to the metal: having better relationships with people.\n\nAs an example, Dave set up a chat app on his website that goes directly to his cellphone. Having more authentic relationships turns customers into his sales team.\n\n![The Parable of the Fisherman @davekiss](https://i.imgur.com/vbHQdGH.jpg)\n\n## 2. Know your reasons\n\nAre you growing your business because you think you have to? You could probably get a bigger ROI from focusing on what you actually want.\n\n\"Growing\" could look like:\n\n* improving your UX\n* clarifying your documentaiton\n* maximizing process efficiency\n* cultivating deeper relationships\n* redesigning your onboarding\n* raising your prices\n\n## 3. Avoid Compulsively Making things Worse\n\nImpulsive growth can:\n\n* Introduce additional risk\n* Slow the decision-making process\n* Bring on extreme technical debt\n* Increase chances of burnout\n\nDo not skip steps. Think this through. Grow within your means.\n\nLook, The internet is the best business platform ever created. Learn in your bedroom on YouTube, reach the other end of the globe\n\nKeep that ambition in check. First decide what you want to be and build that into the core of your company.\n\nThe secret to the best way to scale your company is not a book or an app or a podcast: Being YOU!\n"
  },
  {
    "title": "It Won't Be A Straight Line: A Founder's Journey Starting Growing And Selling A SaaS",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/751240363906506753/L7nAB7nU.jpg",
      "name": "Garrett Dimon",
      "title": "Head of Growth, Wildbit",
      "bioUrl": "http://www.microconf.com/starter/speakers/garrett-dimon/",
      "twitter": "garrettdimon",
      "website": "https://garrettdimon.com",
      "location": "Crested Butte, CO",
      "description": "Husband. Father. Work at @wildbit. And past curator of @sifterapp. Also, LBKA.",
      "verified": false
    },
    "date": "2018-05-03 13:29:02 UTC-07:00",
    "conference": "starter",
    "description": "These are the types of lessons that usually cost an arm and a leg, but I got it half price. Starting any growing a business can be a long journey. Some days are going to suck. Really bad. In some cases, weeks, months, or even years can be incredibly rough. Other times will be great. Business, like life, will have its ups and downs. The key isn’t to chase the ups and dodge the downs. It’s to embrace the journey knowing that it will never be a straight line. It’s not possible to entirely avoid the bad days, but there are always tactics to help you get through. Through his own journey dealing with medical issues, running and ultimately selling his small SaaS business, and slowing down to embrace the new trajectory life had handed him, he’s gained some fresh perspective about making the the most of the chaos at the intersection of living life and growing a business.",
    "image": "https://i.imgur.com/4RL9vIV.png",
    "isPublic": true,
    "body": "\nhttps://business.facebook.com/teamlanio/videos/1679301118785178/\n\nhttps://twitter.com/mijustin/status/989173161844342784\n\nThese are the types of lessons that usually cost an arm and a leg, but I got it half price.\n\n![Garrett has had a rough 4.79 years. He's lost 120 days - 6.8% - of the last 5 years](https://i.imgur.com/AUsrW8J.png)\n\n> There’s really only one thing that I’m truly and deeply afraid of. I have to pay close attention and enunciate very clearly when I tell people I’m going to see my prosthetist.\n\n\"You work for a software company that develops avionics software for airplanes. One day you are taking a business trip. As you get on the plane you notice a small plaque that indicates the plane is using the software your team developed. Who would get off the plane?\" \"Of course! If my team wrote the software, the plane wouldn't even get off the ground.\"\n\nGarrett started Sifter in 2008 because the world needed yet another bug tracker. It fit well with his medical struggles.\n\nHe sold that and started working for Wildbit - it was a great decision to accept he didn't have to be his own boss for the rest of his life.\n\n![Some of the products of @wildbit](https://i.imgur.com/7JcJr3R.png)\n\nGarrett also wrote [Starting & Sustaining](https://startingandsustaining.com/) to pull together all of my advice and experience. The book is freely available on the web. As is a projections worksheet. Now that’s evolved into an almost complete second edition and a podcast interviewing other founders not about success, but about trials and tribulations.\n\n## SETTING THE STAGE - be ready for curveballs\n\n> At my first followup, my doctor unwraps my foot and there’s some frost bite. Thankfully I was able to keep my cool.\n\nfacepalm.gif\n\n> People often ask about my generally positive attitude and outlook. The thing is, it’s actually pretty easy—unfair even—but I literally can’t help but start every day on the right foot.\n\nfacepalm2.gif\n\n> When you’re going through hell, keep going. @winstonchurchill\n\nIn the early days of Sifter during a server upgrade, Garrett had a decision to make that was moderately time sensitive.\n\nIn a hurry, he made a bad choice and deleted 8 hours of customer data. If he had stopped to collect himself instead of acting quickly, he wouldn’t have made the mistake. He knew Sifter was going out of business. In my head.\n\n![After losing 8 hours of customer data, Garrett knew his life was over](https://i.imgur.com/N6N6zb4.png)\n\nIt wasn't actually that bad, though! He learned that **responding beats reacting**. Things will go wrong. Focus on the aspects you can affect.\n\n![Serverless is the new hottness - try codeless by stitching services together!](https://i.imgur.com/xImomZL.png)\n\nInspiration doesn’t strike. It has to be cultivated. Don’t search for ideas. Just start creating and always be on the lookout for ideas.\n\n## VALIDATING AN IDEA\n\nPayment is your best form of validation, so how do you get there?\n\nYou may have an idea, but you don’t want to spend a ton of effort figuring out if it’s good enough.\n\nYou have to get to point where where people will give you money. The faster, the better.\n\nApproach everything with baby steps. Never go all-in on your first attempt. Build enough to justify payment and learn.Then build the real thing.\n\n> The greater the uncertainty as to whether something will work at all, the less excellence you should invest before you find out. @dhh\n\nJust like how you probably shouldn't take a triple hit of morphine, there's always something bitesized you can do on your business.\n\n![How could you start small?](https://i.imgur.com/tar8kSK.png)\n\n> When you have to prove the value of your ideas by persuading other people to pay for them, it clears out an awful lot of woolly thinking. -Tim O'Reilly\n\n**Sales is research.** Talking to potential customers kills two birds with one stone. Then use that to iterate on your offering.\n\n### Version 1 (of Garrett's Leg)\n\nLet’s try the simplest solution.\n\nRecurring revenue from Sifter was an amazing form of disability insurance. It was easy to be scared of health issues, but recurring revenue makes it easier.\n\nPivoting: We learned a little. Some stuff worked. Some didn’t. It’s time to get serious.\n\nGarrett read [Unthinkable by Scott Rigsby](https://www.amazon.com/Unthinkable-Scott-Rigsby/dp/1414333145) going through negative visualization. This dude won the Hawaiian triathalon. The worst case isn't that bad!\n\nMaintain perspective. Not “Well. It could be worse.” But rather “I can handle this.”\n\n### Version 2.0 (of Garrett's Leg)\n\nWe feel confident that the best step is to invest in a more ambitious solution.\n\nGarrett committed to what was supposed to be an 8 hour surgery and ~1 week in the hospital. It ended up being two 10 hour surgeries and 3 weeks in the hospital.\n\nHe learned that tiny steps are still steps. The key is that they’re your steps. Don’t compare your rate of progress to anyone else. (Or to “past you.”). The challenges you’re facing are uniquely yours. Don’t get distracted comparing your journey to anyone else’s. Or even past you.\n\nVersion 2.0 of Garrett's leg was a \"free flap\" (a skin graft + a chunk of ham from Garrett's thigh), but it didn't work.\n\n> “Don’t worry, there are plenty of places I can take the flap from.”\n\nGarrett learned to trust and delegate. Don’t give up when your first attempt doesn’t go well. In our personal lives, we don’t hesitate to trust experts, but with business, too often we try to go it alone.\n\nEven though Garrett's doctor wasn’t confidence inspiring, he was the best person for the job. There was no way I was going to give up and try to do it myself. Yet, in business, all too often, that’s what we do. Delegation is a learned skill, and it’s inherently dependent upon both the delegator and the delegatee.\n\n### Version 2.1 (of Garrett's leg)\n\nAny major effort is going to run into issues and need some follow-on work. Garrett's doctors had already taken one flap from my left leg. They’d need to get another flap. This meant an extended stay in the ICU. 🏥\n\nHe did get a magic morphine button 🔘💊, but his heart rate would go below the alarm level when he tried to sleep. Pain killers. No sleep. Barely eating. A couple of panic attacks. He was in bad shape.\n\n> “We’ll keep you here a few more days and then we’ll move you to the floor.” ...the floor?!?! What the hell kind of hospital is this?!?!\n\nIt was at this point that Garrett reached out to Chris and Natalie (the founders of Wildbit).\n\nProgress isn't automatic. Growing pains are real. At some point, growth will plateau. “If you build it, they will come.” Right? Nope. Growing a business takes deliberate and directed action. Even then, it’s slow.\n\nGarrett learned that growth is just a formula. You have to look at growth and plateaus as simple formulas. Then set goals accordingly. When your business isn’t growing, it’s easy to question literally everything. However, you have to remember it’s just simple math. And that math can tell you _exactly_ what you need to work on. The good news is that you can see these limits coming a mile away. They should never surprise you.\n\n![When your business isn’t growing, it’s easy to question literally everything. However, you have to remember it’s just simple math. And that math can tell you _exactly_ what you need to work on.](https://i.imgur.com/zltaN4I.png)\n\nGarrett learned to work on the right things. The likelihood of working on the right things correlates closely with what customers are telling you combined with your actual growth numbers. Choosing the right things to work on will always be difficult. However, if you understand this formula and break it down, you have some built-in guidance from the business about where you should focus your efforts.\n\nHow do you grow? One of:\n\n1.  Reduce Churn\n2.  Increase Conversion\n3.  Increase Traffic\n\nPhysical therapy is a great metaphor for business. I’ve spent an inordinate amount of time in physical therapy, and it’s very cyclic. It’s about cycles of pain, improvement, plateaus, and making the adjustments to push through the plateaus.\n\nIt’s the same thing with our businesses or careers.\n\nWhen you first learn a new skill or set out on a new path, it’s really difficult. Then it gets easier. Then you get comfortable.\n\nYou constantly have to push yourself outside of your comfort zone in order to grow.\n\nThis is especially true running a business. With each new achievement, you’re going to be playing a new game. You have to adjust.\n\n**Pain and discomfort are part of the process.** Go right up to your limit. Push past it. Suffer a little. Then do it all over again.\n\n### Step back and assess\n\nHow are you doing? Are you meeting your goals? Do you need to try something new?\n\nFor Garrett, it was a major surgery. In business, it may be a major feature release. As things change, it’s important to revisit them and take a critical look at where you’re at.\n\n![For Garrett, recovery plateaued, and his foot wasn’t back in the right position yet.](https://i.imgur.com/6ivx27B.png)\n\nHe learned to focus on tangible goals rather than long-term dreams. Let your dreams light the fire, but remember that incremental and measurable goals are how you really get there.\n\nFor him, the dream was being active again. Playing basketball. Snowboarding. Running. Going hiking or camping with my family. The goals were much smaller: Walk a single mile. Run a single mile. Run a 5k.\n\nIn business, it’s the same. Having your business support you full-time is a dream, not a goal. Finding 5 more customers is an actionable goal. Don’t worry about two years from now. Focus on here and now, and two years will get here fast.\n\n### Make big decisions\n\nTurning points are never easy, and the answer is rarely obvious.\n\nYou will face turning points where you have to make big decisions. For Garrett, it was an ankle fusion or amputation. Fusion effectively meant no running or jumping ever again.\n\nLesson: protect your focus for the things that really matter, and always work deliberately.\n\nDon’t avoid big decisions because they’re hard. Put your head down, do the research, decide, and then execute ruthlessly.\n\nElective amputation is about as scary of a decision as you can make. The permanence is really all that makes it scary though.\n\nThe good news with business is that nothing is permanent. You can always go back and fix it.\n\n![Garrett's ankle. Out of position. Arthritic. He talked to 4 surgeons, and they all advised an ankle fusion.](https://i.imgur.com/YDde6OO.jpg)\n\nSo what’s the deal with amputation again? Just how active can you be? What are the limitations? Thanks to the books and talking to other amputees, Garrett wasn’t scared of amputation.\n\nHe was scared of the permanence and of being wrong, but he was at peace with it pretty quickly.\n\nAll of the amputees he talked to had regret. Specifically, they had one regret…\n\n…the exact same regret.\n\nThey wished they had done it sooner.\n\nAt this point, Garrett and his wife had their second daughter. He was still running Sifter effectively by myself.\n\nThe idea of another major surgery at this point means a lot of burden on Lauren to take care of her family.\n\nFusion would theoretically be a quicker recovery (~3-6 months) with fewer short-term restrictions.\n\nAmputation would mean pushing a lot onto Lauren for the foreseeable future. (~18 months to a full recovery)\n\nThis is a nerve-wracking decision. Amputation felt like it had the best potential for a good long-term outcome.\n\nFusion felt like the safe and responsible thing for Garrett's family as a whole. Yet. With amputation he saw liberation. With a fusion, he only saw shackles.\n\nAnd so they put screws in Garrett's foot. It was the safe play. He originally thought it would be a 6-month detour at worst. They ended up giving it (and other treatments) 18 months.\n\n![Screws in Garrett's foot was the safe play](https://i.imgur.com/ARkrFf5.jpg)\n\nSome time after the fusion, Garrett talked to Wildbit again, but this time, there was a way to move on from Sifter.\n\nThe weight of running a business and feeling an obligation to customers for years of neglect was at odds with the same feelings towards family.\n\nJoining Wildbit was key. He was a terrible boss for himself. Wildbit on the other hand is the healthiest workplace he could imagine. It had been absolutely critical to his recovery.\n\n**For some decisions, there’s not an obvious answer.** You may need to make a leap of faith. Do your research, and make a decision. Sitting still can often be worse.\n\n## Is it good enough?\n\nAfter big efforts, launch, and then re-evaluate. Here we are again, only now I had real data on what a fusion was like.\n\nChronic pain. Middling functionality.\n\nBut he could get by, but was “getting by” enough?\n\nThe thing about amputation is that it’s so permanent. There’s no Command-Z. No matter how confident I could have been, it’s scary.\n\nHe had to have a framework to weight it all.\n\nGarrett questioned what he was capable of. Are those activities pain-free enough to be enjoyable?\n\nHe tried playing basketball again, but could only tolerate about 30 minutes.\n\nSoon, the pain and disability from ankle fusion was bad enough that Garrett started to see that amputation would be better for his family too. It was clear that if functionality was important to Garrett, the fusion wasn’t going to cut it.\n\nAround the same time, after spending 8 years on Sifter and having it financially support him, he sold it. Sifter was in good hands, and he could finally focus more on his recovery or maybe amputation.\n\n**Don’t count on data and logic to provide the right answer.** Too often we try to be 100% confident about decisions that require a leap of faith. These days, there’s so much talk about A/B testing and data. That stuff’s useful, but you can convince yourself of anything.\n\nMoreover, in the early days of a business, you won’t have statistical significance.\n\n### Taking the next step\n\nOnce you’ve handled the basics, the real work begins.\n\n~5 months from deciding to amputate to actually having it. Schedule/rescheduled a couple of times as we tried some other options.\n\nOpportunities to cancel it kept popping up, but I finally said “enough.”\n\n![Waking up with just one leg](https://i.imgur.com/dJIxtzp.jpg)\n\n**It’s ok to let go.** Just because something is holding you back, doesn’t mean you have to hold on too.\n\n### The journey never ends\n\nThere will be milestones, but there’s never a finish line.\n\n> “Daddy, can you run yet? 😊” => “You can’t beat me! 😛” => “Daddy, you’re cheating! 😡”\n\nSix months after amputation, Garrett spent two and a half days snowboarding without pain killers. Today, he can comfortably enjoy a full day on the mountain.\n\n**It’s about progress—not aspirations.** Focus on how far you’ve come because our journeys never end. You’ll never reach a finish line.\n\nGarrett isn't where he used to be, and he's not quite where he wants to be, but he's getting there every day.\n\n> Most people overestimate what they can do in one year and underestimate what they can do in ten. @billgates probably\n\nWhen you’re recovering from injuries, you go to physical therapy. When you’re recovering, you have a physical therapist. When you’re building a business, you find an advisor.\n\n> When you’re recovering, you have a physical therapist. When you’re building a business, you find an advisor.\n\n**Find your people so they can nudge you along safely.** When you’re in the thick of it, it’s difficult to know if you’re pushing yourself too hard or not hard enough.\n\n![Garrett's ability as an amputee ](https://i.imgur.com/zbHMrGj.png)\n\n![Garrett's mountain biking/snow boarding foot has countless adjustments](https://i.imgur.com/zbHMrGj.png)\n\n**Don’t adjust too many variables at once.** With business, you have a ton of dials you can adjust, but only a few matter. Focus on deliberate calibrations rather than random adjustments.\n\n![Garrett can't tease his wife about bringing a suitcase worth of shoes anymore when they travel](https://i.imgur.com/LHRXrUp.jpg)\n\nYou may put on sunglasses or grab an umbrella. Business and life is no different. We can all be confident our circumstances will change. So when it changes, do what humans do. Find a way to adapt.\n\n**We’re all adaptive.** Adaptation is unavoidable, and businesses have to adapt and change too.\n\nWhat we’re adapting to is different. For some it’s losing a leg. For some it’s having kids. For others it’s a new role at work.\n\nYou’re way more adaptive and strong than you realize. You’ve just never had to unleash that strength. It’s there. You just don’t know it yet.\n\nWith that, I want to leave you with one thought…\n\n> \"It is not the mountain we conquer, but ourselves.\" -Sir Edmund Hillary, First to summit Mt. Everest\n\nWe all face struggles, but it’s never really about the struggles. It’s about us.\n\nOr, more specifically, it’s about what we’re truly capable of.\n\nSo, next time you’re facing a mountain, real or figurative, take a step back.\n\nTake a deep breath. Let that mountain light a fire in you.\n\nHave faith in your strength, and go conquer it.\n\n> Next time you’re facing a mountain, real or figurative, take a step back. Take a deep breath. Let that mountain light a fire in you. Have faith in your strength, and go conquer it.\n\n---\n\n# Question\n\n**What markers do you give yourself to know that you're on the right path?**\n\nExplore a bunch of things to figure out what the right thing is to focus on. Even then, there are no guarantees. Find the thing you want to focus on and make sure it's fulfilling and will make money.\n\n**Our public personas are all very cheerful. How did you shape your persona through tragedy?**\n\nI tried not to let it affect my customers. The product would stagnate for a few months at a time, but it was never significant enough to explain.\n"
  },
  {
    "title": "Microconf Growth Intro",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/537394665775833088/N1JHDvju.png",
      "name": "Rob Walling",
      "title": "Drip",
      "bioUrl": "https://www.microconf.com/growth/speakers/rob-walling/",
      "twitter": "robwalling",
      "website": "http://www.robwalling.com",
      "location": "Minneapolis, MN",
      "description": "Serial Entrepreneur. Co-founder of https://www.drip.com/ and http://www.microconf.com/. I'm rarely on Twitter.",
      "verified": false
    },
    "date": "2018-04-30 10:09:47 UTC-07:00",
    "conference": null,
    "isPublic": true,
    "body": "\nAudience:\n\n* 7% Building\n* 2% Essentially Retired\n* 4% Just Launched\n* 87%\n\nTalk topics:\n\n* 80% Tactics to grow\n* 20% amp you up a little bit\n\nSchedule at https://microconf.com/growth/schedule\n\nMicroconfrecap.com (that's this site!) - I'm taking copious notes the entire time and emailing you an ebook summary at the end (sign up at the bottom!)\n\n## Monday Night Meetups\n\nMore flexibility this year in meetups. Go to the crossover Growth/Starter mixer! It's on Tuesday, May 1st at The Beach Club at 7:30pm (also on your badge).\n\n## Wifi?\n\nCheck the back of your badge.\n\n## Twitter\n\nUse #microconf\n\n---\n\n# Starter\n\nAudience:\n\n* 16% need an idea\n* 30% building\n* 14% have an idea\n* 10% just launched\n* 28% launched and growing\n* 2% essentially retired\n\nSpeakers:\n\n* 80% Tactical\n* 20% Inspirational or Aspirational (story arc, how you can manage your teams better, etc.)\n"
  },
  {
    "title": "Why there is no downside in going for it",
    "speaker": {
      "name": "James Tayler",
      "twitter": "james_s_tayler",
      "location": "Auckland, New Zealand",
      "description": "I do software and strategy.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/987537498476703744/a6DNH68V.jpg",
      "website": null
    },
    "date": "2018-05-02 14:35:47 UTC-07:00",
    "conference": "starter",
    "description": "The budding entrepreneurs' Guide to risk. James has made $100k in bitcoin, and prevented a $100k loss in a sushi restaurant investment. Here's his framework.",
    "image": "https://i.imgur.com/PWxTCQH.jpg",
    "isPublic": true,
    "isAttendee": true,
    "body": "\nJames has made $100k in bitcoin, and prevented a $100k loss in a sushi restaurant. Here's his framework.\n\nWhy are we afraid of failure? Because we evolved to be afraid of lions.\n\n## James's Most Epic Failure\n\n![The world's first and only photo sharing network for pictures of spooning. A 1/3rd net worth investment ._.](https://i.imgur.com/pk9H8Jh.jpg)\n\nJames had a stupid investment, but he didn't die!\n\nAssume 100% of the downside risk goes to zero and only take bets you can handle walking away from\n\nConsider the implications of your actions on a 20 year macro and reason through the 2nd & 3rd order effects\n\n## The Emotional Foundation For Risk\n\n1.  Assume 100% of the downside risk goes to zero and only take bets you can handle walking away from\n2.  Consider the implications of your actions on a 20 year macro and reason through the 2nd & 3rd order effects\n3.  Understand your ancient psychology is messing with you and it’s not actually life and death\n\n## Learning Business\n\nJames taught himself business from TV, which helped him be cautious of a restaurant investment broker who didn't know the numbers.\n\nEvery bet has risk and reward.\n\n* 9-5 job: DOWNSIDE = zero; UPSIDE = capped at salary+benefits\n* Business: DOWNSIDE = capped at capital + opportunity cost; UPSIDE = all the money you could possibly make on that venture\n\n![Calculating uncertainty](https://i.imgur.com/baqYlqI.jpg)\n\n![What if you could reduce the unknowns to zero?...](https://i.imgur.com/entgsZ8.jpg)\n\n![Bayes Theorm <3](https://i.imgur.com/jXjJRdg.jpg)\n\n## Expected value\n\nThe formula for expected value is:\n\n```\n(Total Upside * Probability) – Opportunity Cost = Expected Value\n```\n\nSimple case:\n\n```\n($1,000,000 * 25% chance) - $0 = +$250,000 Positive Expected Value\n```\n\nMore realistic case:\n\n```\n($1,000,000 * 25% chance) - $100,000 = +$150,000 +EV\n```\n\n![To reduce your unknown unknowns, go wide and deep on any topics related to business. Intuitively apply Bayes theorem to recursively reduce uncertainty.](https://i.imgur.com/jVavICU.jpg)\n\n## Thought Experiment\n\nWhat If you…\n\n* Read a new book every week\n* Talked to customers / potential customers every day\n* Constantly shipped product\n* Continuously met credible and connected people\n\n…for 300 years?\n"
  },
  {
    "title": "The Killer Combo Of Free Content With Paid Promotion",
    "speaker": {
      "name": "Jordan Gal",
      "twitter": "JordanGal",
      "location": "Portland, OR",
      "description": "Family first, then business, then pleasure. Cofounder at https://carthook.com/ and cohost of http://bootstrappedweb.com/.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/598380760479846401/H2ahjk3H.jpg",
      "website": "http://www.CartHook.com",
      "title": "Co-Founder & CEO, CartHook",
      "bioUrl": "https://www.microconf.com/growth/speakers/jordan-gal/"
    },
    "date": "2018-05-01 16:31:55 UTC-07:00",
    "conference": "growth",
    "description": "CartHook spent about $8k in campaigns from January to March of this year to increase ARR $348k.",
    "image": "https://i.imgur.com/BUFJzVz.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1677237612324862%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/jordan-gal/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n[Download the slides at carthook.com/microconf2018](https://www.carthook.com/microconf2018)\n\n# Content Marketing + Paid Advertising\n\nHere's CartHook's campaign from January to March of this year.\n\nCartHook has been slow in adopting content marketing. Paid advertising, contrastingly, has a clear ROI.\n\nSo what'd they do? **Content Marketing + Paid Advertising**\n\nThey took free content, retargeted their audience, and then offered a free trial.\n\n1.  Get attention: get some mindshare\n2.  Establish credibility: talk about your insight into the market\n3.  Your product: in the context of market trends, you've earned the ability to talk about your own product\n4.  Build audience\n5.  Make offer\n\nIn practice:\n\n1.  Get Attention: CartHook wrote and facebook promoted a \"[$100-Million Dollars Lighting the Way (A Look Back at 2017)](https://blog.carthook.com/100-million-dollars-lighting-way-look-back-2017/)\" blog post.\n2.  Establish credibility: \"[eCommerce Sales Funnels: A New Trend for Big Growth](https://blog.carthook.com/ecommerce-sales-funnels-a-new-trend-for-big-growth/)\"\n3.  \"[Future Trends: What you Need to Know to Succeed in eCommerce in 2018 and Beyond](https://blog.carthook.com/future-trends-succeed-ecommerce/)\"\n4.  Product focus: \"[How (and Why) to Optimize your eCommerce Checkout Experience](https://blog.carthook.com/optimize-ecommerce-checkout/)\"\n5.  Killer feature: \"[The Art of Upsells (Boost Your Order Value While Building Trust)](https://blog.carthook.com/art-of-upsells/)\"\n6.  Repurpose to eBook: [The Advanced Guide to Ecommerce Funnels](#)\n\n## Results\n\nEach post was promoted for 7 days ($4k in ads). Got 127 retargeted free trials, which cost $32/signup.\n\nThese signups converted at 30%, which are paying $200/month.\n\n**$4k spent to get $136k ARR!**\n\n## What's next? MOAR\n\n360 registrations on a partner'd [webinar showing a huge success story](https://carthook.com/webinars/how-to-sell-more-with-carthook) ($1M -> $2M/year in sales) translated into **$212k in new ARR for $4k spent**.\n\n![](https://i.imgur.com/dGFWRaq.gif)\n\n## How can you do it for your company?\n\nWrite and promote: an attention post, a market trend post (what's your unique insight into the market?), write a product post (what does your product...), a killer feature post (what is your differentiating feature that people need in order to succeed?). Then repurpose the content and host a webinar showing real results from someone using your product (promoting and retargeting this too).\n\n[The Greatest Sales Pitch I've Seen All Year](https://medium.com/the-mission/the-best-sales-pitch-ive-seen-all-year-7fa92afaa248)\n\n---\n\n# Questions\n\n**How much time did you spend on this? How will you repurpose this campaign in the future - what's the 5-year strategy?**\n\nIt caught us off guard how well it worked - we're not sure. Unless we really nail the next idea it probably won't work as well.\n\n**Is retargeting just within facebook?**\n\nYes. We also tried retargeting within Google but it didn't work as well.\n\n**Why did you promote the pieces serially instead of in parallel?**\n\nTo capture and build up maximum attention, though we might not do it like this in the future.\n\n**Are there other channels over email that are on your radar?**\n\nPartner webinars.\n"
  },
  {
    "title": "An Unconventional Way to Validate Your Product Idea",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/932726689485828097/n86GsuLG.jpg",
      "name": "Justin Jackson",
      "title": "Founder, Transistor.fm",
      "bioUrl": "http://www.microconf.com/starter/speakers/justin-jackson/",
      "twitter": "mijustin",
      "website": "https://justinjackson.ca",
      "location": "Vernon, BC",
      "description": "Internet stuntman ⚡️I run @megamaker and I'm building @transistorfm",
      "verified": true
    },
    "date": "2018-05-02 10:12:34 UTC-07:00",
    "conference": "starter",
    "description": "Justin Jackson's product roadmap for: identifying who you are and what you want, Choosing a market, Discovering what they want, and Shipping a (small) initial solution",
    "image": "https://i.imgur.com/8RoCyQ1.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1677994718915818%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/justin-jackson/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n# Justin Jackson\n\n- 2008: started working in SaaS (Justin was 28)\n- 2015: Wrote [Marketing for Devs](https://devmarketing.xyz/)\n- 2016: Full-time solopreneur\n- 2018: Building a [podcast startup, Transistor.fm](https://transistor.fm/)\n\n# Story Time\n\nJustin started a showboard shop with two friends in 2003, which was a huge mistake.\n\n![Justin's dream was to start his own snowboard shop](https://i.imgur.com/bExR2as.jpg)\n\n![Justin's snowboard shop opened in 2003 and closed in 2005. At 25, he was $85k in debt](https://i.imgur.com/oW4F5AD.jpg)\n\nHe learned a few things.\n\n## Lesson 1: Choosing the right customer is more important than what you sell.\n\n![This guy's name is \"Fauckler.\" Does it look like he has any money? Snowboarders are bad customers.](https://i.imgur.com/WUTvhcG.jpg)\n\n## Lesson 2: starting small is almost always better than going big.\n\n![The lessons you learn when you start small just get magnified when you go big.](https://i.imgur.com/HXu1ViU.jpg)\n\nIf Justin had started small, he would've known the Faucklers are bad customers, but with smaller stakes. He could've gotten out for cheaper when he realized he didn't like it.\n\n> For an idea to get BIG, it needs to start small -@sivers\n\n## Lesson 3: the way we start businesses is wrong.\n\nThe idea people have behind building businesses is that you:\n\n1.  Have a good idea\n2.  Launch it\n3.  $$$\n\nBut this doesn't work! We we evolved it:\n\n1.  Have a good idea\n2.  Validate it\n3.  Launch it\n4.  $$$\n\nEven product/market fit isn't enough, though. You need more than that.\n\n> You need more than product/market fit. You need market/founder fit, product/market fit, and product/founder fit.\n\nIs your audience a group of people that you want to serve every day for the rest of your life? Is this product a good fit for what you want? Does it match up with your values? Does it get you where you want to go?\n\n---\n\n# Product Validation Roadmap 🗺\n\nAre you at Microconf to find a product idea? Are you trying to choosing a target market? Do you want to validate your product idea? Have you launched, but need more customers? Justin can help.\n\nHere's Justin's step-by-step approach for:\n\n- Identifying who you are, and what you want\n- Choosing a market\n- Discovering what they want\n- Shipping a (small) initial solution\n\n## Section 1: Know thyself\n\n### Question 1: What's your motivation for wanting to build a product?\n\nPeople call Justin for coaching all the time trying to get him to validate their idea. \"I wanna do arbitrage for cryptocurrency!\" - Justin isn't the target market! But he knows you need to figure out _why_ you want to do this.\n\n_\"I want to build a product so that I can \\_ .\"_\n\n### Question 2: What do you value?\n\nWhat [core values](https://jamesclear.com/core-values) do you have?\n\n- Creativity\n- Impact\n- Integrity\n- Adventure\n- Family\n- Wealth\n\nSpecifically, how wealthy would you like to be?\n\n- Very wealthy ($1 million+)\n- Higher than average ($300k / year)\n- Financially secure ($150k / year)\n- Basic needs ($50k - $100k / year)\n\n## Section 2: choose your market\n\nWho do you want to serve? Start with a group of people you want to help. A great business isn't about you, and your dream. It's about helping your customers achieve their dreams.\n\n> A great business isn't about you, and your dream. It's about helping your customers achieve their dreams.\n\nA few ideas for finding your market:\n\n- How do you currently make a living?\n- What kind of customers do you serve at work? (these people are already paying for your expertise)\n- What communities do you belong to?\n- What do you do better than anyone else?\n\n![Ian Landsman's first customers were people he was already serving](https://i.imgur.com/bBR2vdd.jpg)\n\nFactors to consider:\n\n1.  How do they spend money?\n2.  How big is the market?\n3.  How easy are they to reach?\n\n![Björn Forsberg started by building shopify apps - a huge market that spends a lot of money](https://i.imgur.com/7cqMPfI.jpg)\n\nAlso consider how easy your audience is to reach.\n\n![Adam Wathan's audience (PHP developers) is super easy to reach - they all hang out on twitter @adamwathan](https://i.imgur.com/cycSrnX.jpg)\n\n## Section 3: customer research\n\nWhat are the big pain points that already exist? What problems are simmering in your target market?\n\nWhat do they search on Google? What kinds of questions are they asking every day?\n\nHere are some tools to help you out:\n\n- [Productvalidator.com](https://Productvalidator.com)\n- [Answerthepublic.com](https://Answerthepublic.com)\n- [Ahrefs.com](https://Ahrefs.com)\n\n![ProductValidator.com helps you see your audience's pain points](https://i.imgur.com/jqIqCDr.png)\n\nAlso, do interviews! Phone, skype, or in-person.\n\n![Justin got the founder of Balsamiq on a skype call just by asking](https://i.imgur.com/TBQCh0N.png)\n\nQuestions to ask in an interview (for B2B):\n\n1.  What's your focus right now at work? What are you looking to improve?\n2.  What's something you'd like to accomplish, but can't? What's holding you back?\n3.  What was the last product, service, or tool you bought for work?\n4.  What's your least favorite tool you have to use right now?\n5.  What kinds of tasks are you currently doing in Excel?\n6.  What product do you wish existed (but doesn't yet)?\n\nWhat trends are you seeing in the community? Right now in the Microconf community, GDPR is a hot topic.\n\n![GDPR hate is trendy in Microconf](https://i.imgur.com/b55BAEG.png)\n\nSummarize your research\n\n- What patterns emerged?\n- What would say are the #1 and #2 things your market is struggling with?\n- What would it mean for them if you solved that struggle? We're solving problems for real human beings!\n\n## Section 4: your hypothesis\n\nThis group wants `${outcome}`, but struggle with `${struggle}`.\nI can help them by removing these obstacles. Now, their life looks like this: `${better_life}`.\n\nPodcasting example\n\nMany tech businesses want `a branded podcast`, but struggle with `getting listeners`.\nI can help them by:\n\n- improving their show art + description\n- getting them more ratings + reviews\n- making their episodes easier to share\n\nNow, their podcast `has more downloads, and their business has more brand awareness`.\n\n## Section 5: start helping now\n\n> \"If you want to be useful, you can always start now, with only 1% of what you have in your grand vision. It’ll be a humble prototype version of your grand vision, but you’ll be in the game.\" @sivers\n\nWhat's the smallest possible thing you could do that would validate hypothesis?\n\nPodcasting example: a cunsolting service? Video tutorials on podcasting? A wordPress plugin? A simple utility?\n\n> \"Starting small puts 100% of your energy on actually solving real problems for real\n> people.\" @sivers\n\n## Section 6: evaluate results\n\nWhat does initial validation look like?\n\n- ✅ Email addresses\n- ✅ ✅ Preorders\n- ✅ ✅ ✅ Money (best)\n\n> When you ask your audience “would you buy this”, many may say they will, but when it comes time to pay they don’t. Building a list is important, but it’s not a true indication of whether or not a product will sell. True validation comes from people actually paying you for that idea. @PatFlynn\n\nAsk questions like \"what was the last product you bought from work?\"\n\nBefore Jason Cohen built WPEngine, he pitched it to people and asked if they would pay for it, then asked if they'd write him a check for their first month.\n\n![Before Jason Cohen built WPEngine, he pitched it to people and asked if they would pay for it, then asked if they'd write him a check for their first month.](https://i.imgur.com/nu4V0G2.jpg)\n\nOther trends to look for (especially in a client's slack):\n\n- What is your target market investing in? (ex: ReWork podcast is a huge investment from basecamp)\n- What's getting a lot of publicity right now?\n- What are people struggling with?\n\n## Summary of the process\n\nStart with a small free offering. If that works, move to a small paid offering. If that works. build a simple product. If that works, put more features in and charge more.\n\n![Start with a small free offering. If that works, move to a small paid offering. If that works. build a simple product. If that works, put more features in and charge more.](https://i.imgur.com/ZWqFAJC.png)\n\n### Transistor.fm case study\n\nHere's how this has worked so far for Transistor.fm.\n\nJustin started with some small free offerings of podcasts:\n\n- ProductPeople.tv\n- MegaMaker\n- Build Your SaaS\n\nIn the process, he noticed some trends. 75% of people who bought Marketing for Devs, were podcast listeners, and made a huge effort to come talk to him because they felt like they'd known him for years ([\"If you make it to Vernon, BC, I'll buy you coffee\"](https://justinjackson.ca/coffee/)).\n\n![Transistor.fm stair stepper case study](https://i.imgur.com/6IWKaUe.png)\n\nJustin also noticed a trend of tech businesses launching podcasts: StartUp by Gimlet, CodePen Radio, and others.\n\n> \"64.35% of my customers came from hearing me on a\n> podcast.\" -Brian Casel\n\nJohn works for Cards Against Humanity, so Cards Against Humanity was Transistor.fm's first client in starting [The Good News Podcast](http://www.thegoodnewspodcast.fm/).\n\nGoogle is now transcribing and scraping Audio content - that's a huge positive sign in the trend of podcasting.\n\n---\n\n# Questions\n\n**Who's your favorite American podcaster?**\n\n[Adam Clark](http://avclark.com/), for sure.\n\n**If you're already two months in with 6-10 customers, is it worth going back and building the audience?**\n\nI think it is - there's so much pain if you don't figure out the personal questions of what you want, value, and how much money you want to make. If it keeps growing and doesn't match your values you'll end up in a lot of pain.\n\nDon't get stuck making gambling machines in India.\n\n**Is B2C SaaS always a bad idea?**\n\nUgh. Yes, but there's definitely people that make it work.\n\nSaaS B2C businesses are things people desire: Netflix, Spotify, etc. It's hard to deliver that if you're a bootstrapper.\n\nProsumers are different - that sometimes works.\n\n**Do you consider parameters for failures?**\n\nI have much better parameters for success now. Ex: if I can't get 500 people on a mailing list, it's probably not going to work.\n\nSlides are at [megamaker.co/microconf2018](https://megamaker.co/microconf2018). Check out more at [productvalidationchecklist.com](https://productvalidationchecklist.com)\n"
  },
  {
    "title": "How We've Taken Fomo 20 -> 80K MRR in 18 Months",
    "speaker": {
      "name": "Justin Mares",
      "twitter": "jwmares",
      "location": "San Francisco",
      "description": "Founder, @kettleandfire. Builder, @usefomo. Co-author, @tractionbook.",
      "verified": true,
      "image": "https://pbs.twimg.com/profile_images/702974311611518976/6hfJSIFI.jpg",
      "website": "http://justinmares.com",
      "title": "Co-Owner, FOMO",
      "bioUrl": "https://www.microconf.com/growth/speakers/justin-mares/"
    },
    "date": "2018-04-30 10:18:07 UTC-07:00",
    "conference": "growth",
    "description": "Justin Mares grew Fomo 4x in 18 months. He did this with four simple changes that could apply to any product.",
    "image": "https://i.imgur.com/xtKGQNO.png",
    "isPublic": true,
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/justin-mares/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n[Email Justin](https://earn.com/justinmares/)\n\n## Bio\n\nFormer director of revenue, Exceptional Software (acquired by Rackspace for $10M). Currently director of [Fomo](https://usefomo.com).\n\n## [Fomo](https://usefomo.com)\n\nSocial proof app that boosts conversion rates (ex: \"your friend just bought this thing!\"). Used to be a shopify app (\"notify\") doing 18k MRR, then Justin and his brother bought it with seller financing (ask him about this!).\n\nJustin saw a massive conversion boost (20%) by implementing Fomo on his other site, [Kettle and Fire](https://www.kettleandfire.com/).\n\n## First 18 months to 4x\n\nHere's what Justin did to grow Fomo 4x in 18 months.\n\n### Day 1: Raise Prices\n\nSo many people still don't do this. They feel like they want to give their customers a good deal, and raising prices cheats their customers.\n\nJustin raised the bottom tier from $14.99/month to $29/month, and added multiple tiers up to $199/month. Now he could capture the value of higher value customers.\n\nAfter raising prices, they saw basically no difference in conversions. Raising the prices just got rid of \"kicking the tires\" bad customers.\n\n### Day 2: Optimize the shopify listing\n\n> What can we do to increase the likelihood that someone signs up?\n\nShamelessly ask for reviews! \"If you like notify, could you take 30 seconds to help me grow my little business? If you have any feature ideas, let me know! We're adding features over the next few months\"\n\nThis catapulted Fomo to the top of Shopify ratings with 50 new reviews. Shopify is also excited about sharing Fomo. Also [Capterra](https://www.capterra.com/).\n\n### Day 3: Churn\n\nStarted with churn of 1-19%. If their app got delisted, they'd be out of business in 5 months!\n\nHow'd they decrease churn? Lots of no-brainers: show your customers that by using your product, they make more money. Fomo did it with [Mixpanel](https://mixpanel.com) automatic emails.\n\nThey also initiated as many one-on-one emails as they could. Five days after signing up, customers get an email `Intro: ${customer_name} <> ${customer_support}` from the CEO.\n\nAlso, hire! Hire enough people to decrease customer support response time. They also get a much better pulse of what customers want.\n\nAt day 90, churn was down from 19% to under 8%.\n\n### Integrations\n\nFomo invested in building integrations, like a line of Javascript to integrate with with BigCommerce (which cost $1,500). In the first 45 days this integration was live, it made $1,000 (now at ~$8k/month).\n\nAfter doing more integrations, Shopify went from 100% of business to under 40%.\n\nToday Fomo has over 50 integrations.\n\n![FOMO has over 50 integrations](https://i.imgur.com/CrhrxCk.png)\n\nFomo now buys smaller businesses (like [Built with Shopify](https://www.builtwithshopify.com/), ~30k uniques/month), which is like cheating at integrations.\n\n### Results\n\n4x the business! From ~$25k MRR to $100k MRR this month.\n\n---\n\n## Q/A\n\n**How did you decide to hire 3 full time service reps? Did you look at alternatives?**\n\nWe didn't do it from day 1. Our first hire was a customer support person, and they had a positive ROI by preventing churning and upselling. They paid for themself 100x over.\n\n**Did you hire any software developers?**\n\nJustin's cofounder did most of the development, then hired out development to a dev shop investing the founders' money.\n\n**How did you approach the competitors that you acquired?**\n\nOn day 1, we emailed all 20 of our competitors and asked if they were open at all. More than half said they were interested in selling, integrating, and walking away.\n\n**Re: raise prices, how did you come to that magic number? How did you know you weren't pricing too high?**\n\nI still don't know we're at the magic number! We tested it and it worked well. We split tested sending special offers to existing customers (`upgrade now for ${price}!`).\n\n**Did you grandfather existing customers?**\n\nYes, for a year.\n\n**Do you have negotiation tips for negotiation integrations?**\n\nHave something in it for your integration partner! Promote them.\n\n**How are you differentiating yourself from your competitors?**\n\nOne of our biggest competitors just went through YCombinator. There's not a ton we can do with feature differentiation - it's a rat race. What we focus on is the actual experience of using the product. If you have two matching products, integrations and customer support and scaling and the overall smoothness of the experience is what makes the difference.\n\n> If you have two matching products, you'll choose the one with a better overall experience.\n\nThe overall market is bigger with competitors, which actually works to our advantage.\n\n**How did you connect with Zapier?**\n\nWe cold emailed their partner integration partner person. It was pretty easy for us.\n\n**Other than Zapier, do you have an API?**\n\n[Yes](https://www.programmableweb.com/api/fomo) - it's been a big win for our larger customers.\n\n**How do you source and onboard a support team?**\n\nWe hire support from development bootcamps. Dev bootcamps don't make you a strong, facebook-level engineer, so they're having trouble finding work. We put them through the customer support training we care about and another $25k/month technical course\n\n\"You're not good enough to code for real yet, so come here and do customer support and we'll invest in you. After a year you can either get onboarded as an engineer or move on.\"\n"
  },
  {
    "title": "How to Be Funny (Even If You’re Not): Improv-Inspired Copywriting Tips for Software Founders",
    "speaker": {
      "name": "Lianna Patch",
      "twitter": "punchlinecopy",
      "location": "New Orleans, LA",
      "description": "Conversion copy + comedy + cats. Powered by coconut LaCroix + despair. Director @ SNAP (https://snapcopy.co/).  Write funnier copy: https://www.punchlinecopy.com/5-ways-to-be-funnier-in-your-copy/",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/577689936393961473/ggT-UHXp.jpeg",
      "website": "http://www.punchlinecopy.com"
    },
    "date": "2018-05-01 10:12:22 UTC-07:00",
    "conference": "growth",
    "description": "There are so many principles of improv and humor that can help you shape marketing copy, connect with your users, built loyalty, and increase retention.",
    "image": "https://i.imgur.com/h72d0Xs.png",
    "isPublic": true,
    "facebookStream": "https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fteamlanio%2Fvideos%2F1676939992354624%2F&show_text=1&width=560",
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/lianna-patch/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\nhttp://punchlinecopy.com/microconf-2018\n\nThere are so many principles of improv and humor that can help you shape marketing copy, connect with your users, built loyalty, and increase retention.\n\n> My parents have managed to miss all my shows :(\n\nIf your SaaS isn't using humor, you aren't getting the results you deserve. You could be connecting more genuinely with your users.\n\n![Comedy Reading List](https://i.imgur.com/5N8VOFt.jpg)\n\n![If your SaaS isn't using humor, you aren't getting the results you deserve. You could be connecting more genuinely with your users.](https://i.imgur.com/RUTKl38.png)\n\nFunny copy can be _longer_ and _convert better_. There's a strong connection between humor and money.\n\n> There's a strong connection between humor and money.\n\n_\"Ok yeah but my software isn't funny\"_ - is it less funny than [stormwater compliance software](https://www.mapistry.com/)?\n\n## 1. WHY humor affects us\n\nWhy is humor sometimes uncomfortable? It **makes us vulnerable**. Past experiences of offending people make us wary, and we feel like work should be serious.\n\nHumor has huge advantages though. It activates parts of the brain associated with happiness and fulfillment that make us more receptive.\n\n![Don't make your user feel like your product is a taskmaster - nobody wants to do work](https://i.imgur.com/XSirBZe.png)\n\nEven when your campaign is delivering bad news (like prices )\n\n### Humor topics\n\n_What is a joke I don't understand teach me_ - you probably if you're German\n\nPick your humor topic by asking your users what they like (movies, books, standup comedians, dank memes, etc.)\n\n![How do you know what your users will find funny? Literally ask them.](https://i.imgur.com/IaSyp1c.jpg)\n\nOnce you know what your users think is funny, humor topics are anything both you and your users think are funny.\n\n![Humor topics are anything both you and your users think are funny](https://i.imgur.com/ku6gVNA.png)\n\n### Humor Style\n\nGenerally, humor can be either **observational** or **self-deprecating**.\n\n![Observational humor in SaaS](https://i.imgur.com/uIC8w5q.png)\n\nSelf-deprecating humor is making fun of yourself or your product. You're the butt of the joke, so the risk of offending is low.\n\n![Self-deprecating humor in SaaS](https://i.imgur.com/3kIKHFH.png)\n\n## 2. WHERE to use humor to best effect\n\nDon't use humor in your value proposition (the quick line or two of text explaining what it is you do and why your users should care). This could muddy your value proposition and lose your customer quickly.\n\nIf you're sending traffic to landing pages, it's okay to crack a joke because you know more about your users. Surprising humor can keep your user reading.\n\nHumor also works very well in emails and in your app experience (ex: instead of just \"date range\", \"date range be like\" from FOMO has more personality).\n\n## 3. HOW to punch up your copy line by line\n\nThere are three types of comedy punchups:\n\n1.  Show your emotions\n2.  Piss off your grammar teacher\n3.  Lead the way\n\n### 1. Show your emotions\n\nWriting in ALL CAPS (sparingly, so you don't seem like an old person trying to use the internet) is a great way to show emotion in copy.\n\n![Rockin' Green showin' emotion](https://i.imgur.com/uP2QtVB.png)\n\nComic book words - tangible action words - breath emotion into your copy\n\n![ZAPPIN some action words your way](https://i.imgur.com/AJHG2EP.jpg)\n\n![Comic book words in SaaS copy shows emotion](https://i.imgur.com/CzqSj4v.png)\n\nMaking asides is another great way to humanize your copy.\n\n![Making asides in SaaS copy shows emotion](https://i.imgur.com/u22ZFOc.png)\n\nGifs can be great, but use them sparingly. If they're too long, referencing jokes your users won't get, or irrelevent to their context they won't work well.\n\n### 2. Piss Off Your Grammar Teacher (POYGT)\n\nUsing unconventional grammar can increase conversions:\n\n* adsf\n* Including a typo in your subject line (like \"moar\")\n* using contractions and abbreviations (now \"Hot is it going (fellow kids)\", but \"so I wanna know\", \"gonna\", etc.)\n* chop up your sentences\n\n![Humanizing friendly abbreviations to use in copy](https://i.imgur.com/kitKfXY.png)\n\n![Chop up your sentences](https://i.imgur.com/vKXKLMM.png)\n\n### 3. Lead the Way\n\nAsk and answer questions to get right to what your user is thinking.\n\n![Lead the way by anticipating your user's questions](https://i.imgur.com/nqa34fk.jpg)\n\nYou can also try trailing off with ellipsis...\n\n...and including a call to action! \"Upgrade my Bear!\" is a great CTA, \"take a look inside\" isn't.\n\n## Recap\n\n![Key ways of being funny by Lianna Patch](https://i.imgur.com/Z3zygLn.png)\n\n---\n\n# Questions\n\n**Hi, I'm in the funeral niche...**\n\n![\"Hi, I'm in the funeral niche...\"](https://i.imgur.com/OXuMFuJ.gif)\n\n**...does it really work across all industries?**\n\nResults may vary. It's totally possible though. You know your target client: if they're cool with death, it could totally work.\n\n**Do you know a type of humor that can work across age demographics?**\n\nStart with research into what your audience thinks is funny! Now that you know misspellings don't work on older people but do on younger people, you can tailor your humor accordingly.\n\n**Does B2B vs. B2C matter?**\n\nB2C has gone whole-hog with humor. Would you rather have a president that can crack a joke about himself, or one that can't take a joke?\n\n**How do you ask people what they think is funny?**\n\nIt's random and surprises people. Sandwich it between other user research. Ask two questions with data you really need to know, then reward them with a question about what they think is funny.\n\n**We used to have a gif of Arnold lifting weights but it was cats instead of weights, and most people found it funny but some called us animal abusers. What do you do with those kind of reactions?**\n\n![Apparently some people find this offensive](https://i.imgur.com/jxaAK9m.gif)\n\nAsk who your ideal user is - what's the lifetime value of someone who likes the gif vs. those who don't? Focus on people who are worth it to you.\n\n**How do we test what's offensive? Are there baby steps if you're in a sensitive, serious industry like public safety?**\n\nIntegrate humor slowly and cautiously. Test a version of _a_ joke in _one_ email.\n"
  },
  {
    "title": "The Sustainable SaaS: What Permaculture Can Teach Us About Building Software",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/990021288876888064/e7mpmeya.jpg",
      "name": "Marie Poulin",
      "title": "Co-Founder, Digital Strategist, Oki Doki",
      "bioUrl": "http://www.microconf.com/starter/speakers/marie-poulin/",
      "twitter": "mariepoulin",
      "website": "http://learn.weareokidoki.com/launch",
      "location": "Halfmoon Bay, BC",
      "description": "I help people move from 1:1 to 1:many offerings @ https://t.co/H5oPxaKXfl Saas co-founder, online courses + programs: https://t.co/q0mb9i35wM",
      "verified": false
    },
    "date": "2018-05-03 15:44:08 UTC-07:00",
    "conference": "starter",
    "description": "What does permaculture have to do with building a startup? Everything.",
    "image": "https://i.imgur.com/chrhcbw.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1679392802109343%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\nhttps://twitter.com/mijustin/status/989169967286308865\n\nHere's Marie's master class of what not to do. It's a very honest behind the scenes of what's happened since Oki Doki launched, and their journey to sustainability.\n\n![Oki Doki helps people launch online courses and productized services, with Mochi - their head of customer happiness](https://i.imgur.com/h7g4mwF.jpg)\n\n![Marie and Ben's house on the sunshine coast of Canada. They had to learn how to maintain the land: chopping wood not giving a good gosh darn](https://i.imgur.com/IKm1wvA.jpg)\n\n<!-- ![](https://i.imgur.com/gOkWchW.jpg) -->\n\n![Permaculture design certificate with cats hanging out in a field? This will be good.](https://i.imgur.com/71Qn6lB.jpg)\n\n![Permaculture: A set of techniques and principles for designing sustainable human settlements. - Toby Hemenway](https://i.imgur.com/4o38hjU.png)\n\n![There's no right answer to how to do permaculture](https://i.imgur.com/bt7y9pn.jpg)\n\n![There's no right answer to how to do SaaS, just like in permaculture](https://i.imgur.com/wHW6RTQ.jpg)\n\nWhat would our SaaS look like if we had designed it on purpose? Marie and Ben stumbled into it.\n\nOutline:\n\n* How we launched our idea(s)\n* what we got wrong (and right)\n* What permaculture can teach us\n* What it means for you\n\n![Relevant permaculture principles for SaaS](https://i.imgur.com/WDG7u8H.png)\n\n# 1. How Marie and Ben Launched their Idea(s)\n\nBen and Marie didn't start with any customer research or audience building, but they did get $10k for their first Digital Strategy School. The beta later made $50k.\n\n![](https://i.imgur.com/FwxXTuX.png)\n\n## 1. Observe & Interact\n\nPay attention to the patterns.\n\n![Observing and Interacting to and with your environment is a basic tenant of permaculture. You're spending up to a year just observing your land before making any major decisions.](https://i.imgur.com/QcLNVZ9.jpg)\n\n![Observing and Interacting to and with your environment is a basic tenant of SaaS, as in Permaculture](https://i.imgur.com/3yTL0Bo.jpg)\n\n> We didn't do enough research. This is really something I wish I'd understood before we started building.\n\nMarie and Ben could've learned a lot from 10 or 20 customer interviews before touching a line of code.\n\n![](https://i.imgur.com/LebjYzk.png)\n\n![Oki Doki's path skipped the necessary permaculture lessons](https://i.imgur.com/RmHX1pX.png)\n\n## 2. User Small and Slow Solutions\n\n![You can't start with a tropical oasis - just start with the smallest little piece. In permaculture, a raised garden bed is a great small start](https://i.imgur.com/RmHX1pX.png)\n\nOki Doki made several mistakes:\n\n* New endeavour\n* New technology\n* Complex functionality Multi-layers of user permissions New (to us) market\n* Very competitive space Committed before any revenue Over-engineered for growth\n\nThey should have started small:\n\n* Interview 20 people\n* Design prototypes\n* Landing page with signups Blog posts\n* Office hours Consultations\n\nThey did our first demo once the product was already built to scale - **don't do this!!!** Bring in someone at the rough and ready state to play with it. Observe them to see how they're using it. Product demos - just watching someone using their tool - are very humbling. Things you think are intuitive aren't. You are not your audience.\n\n> Product demos - just watching someone using their tool - are very humbling. Things you think are intuitive aren't.\n\nThey built it in secret - **don't do this either!!!**\n\n> \"Oh, I had no idea you had a platform - I already signed up for a competitor!\" - \"friend\"\n\nWe were letting our competitors lead our innovation (instead of our customers). Your customers have the most to teach you.\n\n> Embrace small, imperfect progress. Your customers have the most to teach you.\n\nWhat should you do? Tell people what you're working on and be in conversation constantly:\n\n* Share early concepts\n* Don’t wait until your product is polished to share it\n* Do things right the first time\n* Be honest about your limitations\n\n![When Marie went to Microconf for the first time in 2016, she had her mind blown by all these new concepts: churn, MRR, CAC - she realized she had a lot to learn](https://i.imgur.com/qJDXlpL.png)\n\nEven with these mistakes, they managed to get to $1k MRR.\n\n## 3. Design from patterns to details\n\n![](https://i.imgur.com/TZRuJN7.jpg)\n\nDon't focus on the details:\n\n* Technical stack\n* Specific Features\n* Create a course\n* Sell a course\n* Deliver a course\n\nFocus on the patterns:\n\n* Diversify offers\n* \"how do I turn my 1:1 into training?\"\n* Bundle offers\n* Services onboarding\n* Mentorship\n* Guided course experiences\n* Course fatigue\n* Imposter Complex\n* Procrastination\n\nWe were so focused on the details of execution that we were missing out on the larger patterns of behaviour.\n\nOur ideal customers were entrepreneurs who had high-touch coaching programs.\n\nOur customers kept extending their trial because their courses were taking them way longer to build than they expected.\n\nTo zoom out and make sure you're not getting caught up in the details, ask \"how might we\".\n\n![Ask real questions that solve your audience's problems, not \"how might we build a course platform and help sell people sell their courses?\"](https://i.imgur.com/4IZ2AjZ.png)\n\nDesign generally before specifically; Understand the underlying patterns\n\nSummary:\n\n* Ask “How might we?” questions\n* ZOOM OUT: Understand the problem from all angles\n* Understand the emotional context surrounding the problem\n\n![Marie and Ben realized they needed to integrate more of their efforts](https://i.imgur.com/6biDh0D.png)\n\n## 4. Integrate, rather than segregate\n\n![](https://i.imgur.com/kfrPFZr.jpg)\n\nIntegration\nWhat do we each want to get out of the business?\nHow can we collaborate and make better make use of our existing resources, skills, strengths?\nHow we make things easier?\n\nReality check: It was easier to sell $2k/mo consulting retainers than a $49/mo SaaS subscription\n\nReality check: It was easier to sell a $1k coaching program than a $49/mo SaaS subscription\n\ntwitter brennan dunn as somebody with a business that can do nearly in a weekend with a super targeted promo\n\nhttps://twitter.com/brennandunn/status/982326554414985216\n\nMarie then:\n\n* Hired Instructional Designer\n* Put Digital Strategy School on hold\n* Did Deeper Customer Research\n* Introduced Course Consulting\n* Shifted Company Positioning\n\n> \"Why do you hate making money?\" -Ben\n\nThey went back to what we knew how to do best: working with clients 1:1. That meant noticing:\n\n* Spending way too long building courses and programs before validating the idea\n* People were signing up for a platform long before they had content ready to go (then procrastinating)\n* Amateur course creators were fire-hosing their learners with too much information\n* New(ish) product creators were expecting their first courses to replace their client income\n\n![Marie and Ben launched a new service that used their audience's language](https://i.imgur.com/uAGo3ik.jpg)\n\n![](https://i.imgur.com/ZhFPkq7.jpg)\n\n![On-demand demos have become a lead generation tool for OKI DOKI's services](https://i.imgur.com/sq5O5MY.png)\n\nWe finally had an integrated product / service / SaaS ecosystem.\n\nWhat now? On-demand demos have become a lead generation tool for our services.\n\nElements should work collectively toward a stronger whole:\n\n* Leverage existing skills + assets\n* Think holistically\n* Integrate services into your SaaS\n* “Many hands make light work”\n\n## 5. Creatively use and respond to change\n\n![The problem is the solution](https://i.imgur.com/7PcKtgx.jpg)\n\nWe had to adapt in a way that made sense for the way we work with people.\n\nWe knew we didn’t want to be the “build your 6-figure passive income course” people.\n\n2 years of working with course creators and coaches finally gave us the insights we were looking for.\n\nWe stopped worrying about what our competitors were doing, and focused on what our customers needed.\n\n![](https://i.imgur.com/xNsrrqZ.png)\n\n![](https://i.imgur.com/Hw2TWtA.png)\n\nWhat happened? Everything became easier. Better copy creates resonance, which helps you stay competitive.\n\n“When life gives you lemons, make lemonade”;\nTurn change into opportunity\n\n* Change is inevitable\n* Problems are opportunities\n* Listen to your customers over your competitors\n* Find your unique edge\n\nPermaculture principles:\n\n* observe & interact\n* use small and slow solutions\n* design from patterns to details integrate, rather than segregate\n* creatively use and respond to change\n\n- Deeply Understand the people + problem\n- Favour small progress and share iterations\n- design for generalities before specifics\n- Think of everything as a functioning whole\n- Embrace change and adapt\n\nIt took OKI DOKI 3 years to find our groove + become sustainable. Is your SaaS part of your business, or is it your business?\n\nWhy would we hustle so damn hard... for a life we already have? Once we let go of the “shoulds” and the FOMO, we realized that we could make a great living as a small company, and love our life.\n\n![Why would we hustle so damn hard... for a life we already have?](https://i.imgur.com/jZZI4Qt.jpg)\n\nWhat do you want to get out of your SaaS, and how hard are you willing to work for it?\n\nWe’ve made a conscious choice to grow slowly, with less stress and less FOMO.\n\nlearn.weareokidoki.com/launch\n\nCheck out [Gaia's Garden](https://www.amazon.com/Gaias-Garden-Guide-Home-Scale-Permaculture/dp/1603580298) for more on permaculture.\n\n---\n\n# Questions\n\n**Being married to your business partner, have you set up \"just in case\" scenarios?**\n\nWe treat eachother like equals and give eachother a ton of autonomy. We found out we have to have a meeting every week to get on the same page. Weekly meetings and checkins, being honest about strengths and limitations, and getting an outside perspective.\n\n**What other ways can you know if you're creating resonance?**\n\nGet your friends to describe what you do to someone else. How do outside people perceive you? What words do they use?\n"
  },
  {
    "title": "Micropreneur Hiring, get the right team so you can relax a little",
    "speaker": {
      "name": "Matt Molter",
      "twitter": "",
      "location": "",
      "description": ""
    },
    "date": "2018-05-01 11:27:36 UTC-07:00",
    "conference": "growth",
    "description": "Hiring can easily be a trap to fall into. Get these three things right and you won't fall on your face.",
    "image": "https://i.imgur.com/GQQFyKy.png",
    "isPublic": true,
    "facebookStream": "https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fteamlanio%2Fvideos%2F1676996419015648%2F&show_text=0&width=560",
    "body": "\nMatthew founded Agency360, but screwed up in hiring his team.\n\n> I didn't just screw up hiring my first employee. I screwed up hiring my first FIVE employees.\n\nLooking back, he sees hiring as a banana peal trap. If you do it wrong, it can be super stressful and lead to lost revenue.\n\n## 1. Know What You Are Looking For\n\nPut a lot of work into the job description. Make sure you're answering:\n\n1.  What do you need?\n1.  What culture are you creating?\n1.  What will the person do?\n1.  Why should they work for you?\n\nBe as transparent as possible. If you're hiring a sales manager, let them know 60% of their time will be working on inbound leads and emails, but 30% of your time should be on outbound things, and 10% will definitely be on random stuff because we're a small company.\n\n![Define what success looks like for your job applicants](https://i.imgur.com/6xX27LG.png)\n\n## 2. Don’t Be Desperate\n\nDon't just hire the first available person. Being able to wait for the right person will get you better people. Make sure you're thinking about:\n\n1.  What location do they reside?\n1.  Who might know these people?\n1.  Where do/have they worked?\n1.  Why should they switch?\n\n## 3. Ensure They Have the Right Skills\n\nDon't just rely on a reference. Potential hires aren't necessarily qualified because they worked for a big company. Bring them in for a longer interview and directly test:\n\n1.  Have they done this before?\n1.  What is their thought process?\n1.  Are they driven to improve?\n1.  Do they work well with the team?\n\nThe cream of the crop rises quickly with open-ended real-world-mocked tests.\n\n![Give potential hires exercises to directly test their skills](https://i.imgur.com/BGoMgWz.png)\n\n## Recap\n\nTo hire better (and not step on the banana peal trap of hiring):\n\n1.  Be clear about the job\n2.  Don't be desperate\n3.  Make sure they have the right skills\n\nmatt@agency360.com\n"
  },
  {
    "title": "Cold email to get informational interviews - a 9-item checklist",
    "speaker": {
      "image": "",
      "name": "Matthew Du Pont",
      "website": "https://unusuallydifficult.com",
      "location": "",
      "description": "Matthew works 3 days a week for Poll Everywhere in software sales, and started a job search coaching business 11 months ago. He's been doing 1:1 coaching for a year and am now starting to create infoproducts. Previously, he raised VC funding for a mechanical part sourcing business, worked in a few product roles including at OkCupid, and was a consultant at BCG."
    },
    "date": "2018-05-02 14:25:25 UTC-07:00",
    "conference": "starter",
    "description": "What is an informational interview? The stated goal is just learning, but it's actually about learning, user feedback, sales, and connections.",
    "image": "https://i.imgur.com/AlS4ozN.png",
    "isPublic": true,
    "body": "\nMatthew will send you [a free copy of his ebook](https://tiny.cc/microconf)\n\nWhat is an informational interview? The stated goal is just learning, but it's actually about learning, user feedback, sales, and connections.\n\nThis method isn't conclusive - it's only been used by 9 people with a 15-40% success rate. It's worth taking a look.\n\n## 1. Similarities\n\nPoint out similarities between you and your cold email target. Not \"We’re both entrepreneurs.\", but \"We both worked in product management before starting self-funded companies.\"\n\n## 2. Right person\n\n\"You’ve sold to IT managers in your last few jobs, and I’m trying to learn what they care about most.\", not \"I'd like to learn more about sales.\"\n\n## 3. Right company\n\nGood: I’ve spoken with Person X and Person Y about ExampleCo, and they both raved about how willing the company is to invest in employee’s growth.\n\nBad: ExampleCo has a great culture.\n\n## 4. Right conversation\n\nCome in with specific questions, not open ended.\n\nGood: I think the most important next steps for my business are X, Y, Z. I’d like to see if you agree, and talk about some strategy for X because you’ve used that tactic extensively in the past.\n\nBad: I want to learn more about your experience.\n\n## 5. Offer to help (optional)\n\nGood: It looks like your design team does a lot of user testing. Would it help if I was a tester in your next UX experiment?\n\nBad: I’d be happy to help if I can.\n\nBad: I'd love to help however I can.\n\n![Example cold email to Patrick McKenzie that nails the first five tacts of cold emailing. What's the one thing you should never do in a presentation? Put a huge amount of text on the slide and read it verbatim.](https://i.imgur.com/sq8jOW3.png)\n\nThe next four are logistical.\n\n## 6. Offer times, and 7. Offer a venue\n\nMake sure you've got:\n\n* the timezone\n* times during the workday, in the evening, and on the weekend\n* send it far in the future. People don't know if they're busy in 2 weeks, so it's easier to accept\n* give the perception that you're busy. \"I can do any time Monday, Tuesday, Wednesday, or Thursday. Please please please call me.\" is bad\n\nGood: I can jump into a 15 minute phone conversation (all times PST) Thursday between 3PM and 7PM, Saturday between 2PM and 8PM, or Monday between 8AM and 11AM.\n\nCalls or video conferences are less commitment and easier to say yes to. More commitment drinks or dinner is harder to say yes to but can create a stronger bond.\n\n## 8. Send at the right time and 9. Follow up at least once\n\n![Don't get lost in the Monday pile of giant email. Tuesdays are good.](https://i.imgur.com/J8zLDMs.jpg)\n\nTry using [Less Annoying CRM](https://www.lessannoyingcrm.com/) and [Monica](#) to keep track of\n\n![Recap](https://i.imgur.com/k9ZrRG4.png)\n"
  },
  {
    "title": "Following up... Without looking and feeling like a dirt bag",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/567766029040775168/DNxZdGGX.jpeg",
      "name": "Mike Taber",
      "title": "Founder, Bluetick.io",
      "bioUrl": "http://www.microconf.com/starter/speakers/mike-taber/",
      "twitter": "SingleFounder",
      "website": "http://www.singlefounder.com",
      "location": "Massachusetts",
      "description": "Entrepreneur: MicroConf, Startups for the Rest of Us, Moon River Software, http://t.co/3fhJflkN8u & Author of http://t.co/i0vvCpPFhr",
      "verified": false
    },
    "date": "2018-05-02 16:50:42 UTC-07:00",
    "conference": "starter",
    "description": "Microconf 2018 talk recap",
    "image": null,
    "isPublic": true,
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/mike-taber/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\nhttps://twitter.com/mijustin/status/989175153388015616\n\n# Outline\n\n1.  Intro\n2.  Why Follow Up\n3.  What happens on the Other End\n4.  Why don't we follow up?\n5.  Follow up strategies that actually work\n\n# 1. Intro\n\nMike is behind Startups for the Rest of Us, the Single Founder Handbook, Microconf, and (most recently) bluetick.io\n\nClarification: **follow up email != cold email**\n\n# 2. Why Follow Up\n\nThere are four things you want to know when following up:\n\n1.  Was it received?\n2.  Did they understand it?\n3.  Did they make a decision?\n4.  Did they inform you of that decision?\n\nIf you're not answering these questions, your email is getting sent into the void - the email black hole.\n\n# 3. What happens on the Other End\n\nThere are four reasons why people don't reply to emails, even if it's important to the recipient:\n\n1.  **They never received it**. Either mail server issues (surprisingly common), the wrong email address, it was filtered as spam, or the person is out of the office/vacationing/traveling.\n2.  **Received, but dismissed**. Either email filters or rules, irrelevant subject line, they skimmed the email and made the wrong decision, a gatekeeper rejected it (like if someone isn't managing their own mailbox), or they were scarred off because of a wall of text.\n3.  **Received with best of intentions**. Either they're traveling, working remotely, on a mobile device, their mailbox is flooded, they've declared email bankruptcy, the email has dropped off their radar, something is on fire, or there's guilt from not responding sooner. Followups give them permission to reply.\n\n> Followup emails give people permission to reply.\n\nhttps://twitter.com/patio11/status/966283826686144513\n\n![This is not how people feel when you follow up](https://i.imgur.com/l9yVLEs.jpg)\n\n# 4. Why don't we follow up?\n\nWhy don't we follow up?\n\n1.  **Incorrect value association**. Value is a measurement of what the email does for the recipient, and what a response means to the sender? If the value of a response doesn't feel measurable,\n2.  **Time constraints**. Either it feels like busy-work, or because... deadlines.\n3.  **Your emotions will get the better of you**. Sending follow up emails is emotionally painful. You feel like you're repeating yourself and negative emotions are disproportionally outweighing the positive ones.\n4.  **We're afraid**.\n\n![Douglas Adams probably didn't follow up in emails](https://i.imgur.com/8eCTxtl.jpg)\n\n# 5. Follow up strategies that actually work\n\nhttps://twitter.com/SamNeter/status/968090271421534208\n\n> If you're ever feeling bad about yourself, remember that someone approved the movie Sharknado\n\nOpen rate of 26.7% is actually the worst open rate on Bluetick. Several are getting close to 100%!\n\nReply rate average is 5.9% - the best is close to 30%! The way to close that reply loop is to just send more emails.\n\nWhat percent of people are blocking tracking pixels in email? Depends on your audience - it ranges from 0% to 62.5%.\n\n## The Four Pillars of Followup Success\n\n1.  When: select the situations where it makes sense and the schedule to follow up. After first contact and after a demo work well.\n2.  Personalization: Use their name, use your own domain, reply to previous emails you send, etc.\n3.  Action: clearly define the single action you want the person to take\n4.  Automation: templates, software, reminders, Zapier, outsourcing, etc, done in a way that doesn't appear to be automated\n\n![](https://i.imgur.com/0wZ8iTU.jpg)\n\nWhen you get into personalization, you have to be really careful. Don't send an email that starts \"Hi ,\", or \"Hi FNAME\".\n\n![Don't send a personalized email to \"Hi ,\", \"Hi $FNAME\", or \"Vagina\"](https://i.imgur.com/1IX1UTg.jpg)\n\n### Example: design your followup process to get a prospect to schedule a demo\n\nTODO: email sequence examples\n\n[Learn How to Automate Your Followups](https://bluetick.io/course-learn-how-to-automate-your-followups/) on [bluetick.io](https://bluetick.io/) is a free 6-part email course.\n\nQuestions? [Email mike](mailto:mike@bluetick.io).\n\n---\n\n# Questions\n\n---\n\n**How do you send breakup emails?**\n\nTypical breakup email says \"hey I've sent you several emails, I can see you're not interested, so I'll never email you again\". This closes the door to emailing them in the future. A better reply is \"hey, I can see this isn't a good time for you. I'll followup again in 6 weeks.\"\n\n**I'm worried about an automated system following up when I've already followed up in a different way. What should I do?**\n\nIf your call to action doesn't apply if you've had another interaction (ex: \"let's schedule a call\" when you've already had a call), you should trigger those manually. Once the illusion of personal responses has been destroyed, your response rates go way down.\n\n> Once the illusion of personal responses has been destroyed, your response rates go way down.\n\n**Do you legally have to have an \"unsubscribe\" link in automated emails? Is that a tell?**\n\nIt's toeing the line either way. Even if you have an unsubscribe link, you can still be breaking the law. Bluetick doesn't include them.\n\nThere are three legal categories of email:\n\n1.  transactional\n2.  commercial (where CANN spam laws come into play)\n3.  other (good job naming this one, government)\n\nMost email providers make you include an unsubscribe link so their entire server doesn't get blacklisted, not for legal reasons.\n\n**What's the best communication channel to followup?**\n\n[Multichannel marketing](https://en.wikipedia.org/wiki/Multichannel_marketing)! There's a lot of value following up in different channels.\n"
  },
  {
    "title": "How to Launch and Scale Your Business With Facebook Ads",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/934099240829292546/G_5YTmVW.jpg",
      "name": "Mojca Žove (Mars)",
      "title": "Founder, Super Spicy Media",
      "bioUrl": "http://www.microconf.com/starter/speakers/mojca-mars/",
      "twitter": "mojcamars",
      "website": "http://www.thefacebookadsacademy.com",
      "location": "",
      "description": "Founder of Super Spicy Media. Facebook Ads Expert. Alpha Female. Geek. Coffee lover. Full-time dinosaur. Buy my book: https://t.co/rqsBtZxOFg",
      "verified": false
    },
    "date": "2018-05-03 11:11:53 UTC-07:00",
    "conference": "starter",
    "description": "Mojca is a Facebook Ads expert, author, and international speaker. Her work focuses on helping businesses generate more leads and increase profits with a carefully developed Facebook Advertising Strategy, so they can devote their time to other aspects of their business. She is the author of the Facebook Ads Manual: Everything You Need To Know To Get Started and the creator of The Facebook Ads Academy.",
    "image": "https://i.imgur.com/rD2yjg0.png",
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1679186075463349%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\nhttps://twitter.com/mijustin/status/988987906655109120\n\nhttps://twitter.com/patio11/status/991106078262755328\n\n![Family is the most important reason for doing the microconf thing](https://i.imgur.com/uofrZHi.jpg)\n\n## About Mojca\n\n![You can do weird shit in vegas.](https://i.imgur.com/BzDDgq5.jpg)\n\nMojca works with companies to help them run facebook ad campaigns.\n\nIn the past, common sense was not to do B2B facebooks ads. Mojca launched Super Spicy Sessions to make a semiautomated pipeline to run campaigns to businesses. It worked super well.\n\n# Facebooks Ads\n\n## Why aren't you doing facebook ads?\n\nCommon reasons not to do facebook ads are:\n\n* complicated\n* time-consuming\n* expensive: I spent $1k and nothing happened!\n* don't know where to start\n\nThese are excuses - throw them out and let's talk strategy.\n\nIt used to be super hard to get in front of people. Now you can get in front of people for $10 - take advantage of the new technology!\n\n## Why Most Facebook Advertising Campaigns Fail\n\nUsually, facebook campaigns fail from:\n\n1.  **Selling to cold audiences directly**: you wouldn't knock on a stranger's door and ask to sell them a $50 ebook - they wouldn't trust you! You haven't built any authority. This is a bad idea.\n2.  **Wanting to close the deal too quickly**: someone that has visited your homepage isn't a customer prospect. You need to build up more trust first.\n3.  **Optimizing for the wrong metrics**: you probably don't want to optimize for clicks.\n\n![Before you launch your first campaign (even if you don't plan to advertise on facebook soon), spend two minutes implementing the Facebook Pixel - a code that lets you track your audience's behavior](https://i.imgur.com/F7HKRBU.png)\n\nCheck out [Facebook's guide to implementing the Faceboo Pixel](https://www.facebook.com/business/learn/facebook-ads-pixel)\n\n## Facebook advertising Funnel\n\nA typical facebook ad funnel looks like:\n\n1.  Attract visitors\n2.  Generate leads\n3.  Close sales\n\nFor each layer, define:\n\n* what is the **goal** of this campaign? what do I want to achieve?\n* what is the **asset** I want to promote?\n* who is the **audience** I want to reach?\n* what's the **approach** that I need to take to achieve that goal?\n\n## 1. Attract Visiitors\n\n### Goal\n\n* Make the first connection through value.\n* Build trust and establish authority.\n* Facebook pixel tag so you can collect people in an audience and retarget them later.\n\n### Asset\n\nSomething your audience can implement theirselves.\n\n* Valuable blog posts.\n* Video content. Facebook is really strong on video. You don't need professional gear - videos taken with your phone in 5 minutes are fine. Talk about something valuable.\n\nDon't know what to promote? Look at your popular blog posts.\n\n### (cold) Audience\n\nThere are two approaches you can take:\n\n* **Interest Targeting**: target people based on what they like. You can target competitors.\n* **Lookalike Audiences**: upload your existing customer email list and facebook finds more people similar to that audience with AI magic 😲🧙‍\n\n_Note from Christian: advertisers are the true customer of facebook. It's a fantastic service_\n\n### Approach\n\n* Powerful headline\n* Branded design\n\n![\"How to get paid 100% Upfront\" is a powerful headline because it sparks the audience's interest. The copy came directly from his audience.](https://i.imgur.com/jL6MsxZ.jpg)\n\n## 2. Generate Leads\n\n### Goal\n\nThe goal in generating leads is to use your first transaction to filter a qualifying audience.\n\n![](https://i.imgur.com/GGqd2eg.png)\n\n### Asset\n\nMake sure your asset is actually valuable. It can take the form of:\n\n* Ebook\n* Cheat Sheet\n* Checklist\n* Email course\n* Free Trial\n\n### (retargeted) Audience\n\n* Blog post readers\n* Top webpage visitors\n* Contact page visitors: they were actively looking for a way to contact you. Maybe they didn't have time? ¯\\\\\\_(ツ)\\_/¯\n\n### approach\n\n* Reiterate pain\n* Specific outcome\n* Clear & strong CTA\n\n![A great lead generation ad. Specific language, branded design, clear call to action - join egghead!](https://i.imgur.com/inCyL4U.png)\n\n![Another great lead generation ad with less copy for a timetracking app for construction companies. Reiterate the pain. Great way to generate leads or close sales.](https://i.imgur.com/dcre370.png)\n\n## 3. Close Sales\n\n### goal\n\n* Profits\n* Scaling your business (easy if we've done the previous steps correctly)\n\n### asset\n\nRestaurants start you with a tiny appetizer then work up to the main course. Don't offer the $5k consulting right away - start with something smaller and scale up.\n\n* Tripwire product: if you have a super expensive product, try pitching a more affordable product\n* Productized service\n* Software\n\n### (retargeting) audience\n\n* Existing Leads\n* Pricing Page Visitors: maybe they forgot! Maybe they were on their iPhone and couldn't sign up\n* Sales Page Visitors\n\n### approach\n\n* Creative: Focus on specific buyer persona. CEOs of construction companies? Talk specifically to them. Service business providers? Talk specifically to them.\n* Communicate specific value proposition. What will they get out of this?\n* Social proof & Testimonials\n\n![CEO Warrior is a coaching company for service business providers. Take the words from your audience and put it in your ad. ](https://i.imgur.com/WXb16ND.png)\n\n![\"Do you remember those boring 8-hour courses you had to sit through?\" - YES!](https://i.imgur.com/hDq1KGB.png)\n\nThe main problem ClockShark's audience has is dealing with paper timesheets. This ad just takes their audience's words and uses it. Be specific.\n\nYour customers are willing to support you if you ask.\n\n![1/2](https://i.imgur.com/bulo9jw.png)\n\n![2/2](https://i.imgur.com/SqRwgei.png)\n\n# Recap\n\nFacebook ads can convert a complete stranger into a prospect by offering them value. A prospect with a lead magnet can convert into a lead. A lead converts into a customer 💸\n\n![Facebook ad qualifying process](https://i.imgur.com/mTDiskf.png)\n\nThis is hard. Did your first blog post become viral? Was your first business amazing and really successful? It's going to take you a couple of times. Don't give up!\n\n---\n\n# Questions\n\n[Follow @mojcamars](https://twitter.com/mojcamars), [email her](mailto:mojca@superspicymedia.com), and [download her slides](https://superspicymedia.com/microconf2018).\n\n**Facebook cuts long copy off at 2 lines. Is it worth it? Your images also had a lot of text, which facebook doesn't like**\n\nI know it sounds weird, but people read long copy. We did hundreds of A/B tests between long and short form copy. **Long form performed way better than short form copy every single time**. Test it yourself.\n\n> Long form performed way better than short form copy every single time\n\nFacebook's visual rule is not to use more than 20% of your image for text. Facebook limits the reach on text more than that, but images with text convert way better. Experiment with it - you'll learn a lot.\n"
  },
  {
    "title": "12 Principles Of Viral Content",
    "speaker": {
      "name": "Nadya Khoja",
      "twitter": "NadyaKhoja",
      "location": "Toronto, Ontario",
      "description": "Head of Marketing at @Venngage and Creator of drinkwithnadya.com. Speaker. Feminist. As seen on @HuffingtonPost @Entrepreneur @TheNextWeb @Forbes",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/926192830103605248/FinQetz7.jpg",
      "website": "https://www.venngage.com",
      "title": "Director of Marketing, Venngage"
    },
    "date": "2018-04-30 13:45:22 UTC-07:00",
    "conference": "growth",
    "description": "When making viral content, most people focus on clickbaity titles. This will get a bunch of content generated, but it won't be quality content that actually engages users.",
    "image": "https://i.imgur.com/2wYG6Ew.png",
    "isPublic": true,
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/nadya-khoja/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n# [Vengage](https://www.venngage.com)\n\nMission: make design and data accessible for everyone\n\nVengage grew from $8k MRR -> $350k MRR over 3 years. How?\n\nOver this growth, Vengage has focused on organic traffic and content marketing.\n\n# About Nadya\n\nNadya got a theatre degree in a program without a script - the direction was just to \"make a great story\".\n\n> Make a show and tell a great story.\n\nHaving too much freedom can be stunting. In this theatre program, Nadya and her classmates focused on their limitations. What were they not allowed to do?\n\nBy focusing on their limitations, they could be more creative.\n\n# What is Viral?\n\nContent that is circulated rapidly and widely from one web user to another.\n\nWhen making viral content, most people focus on clickbaity titles. This will get a bunch of content generated, but it won't be quality content that actually engages users.\n\n## How do you create quality content?\n\nInstead of focusing on what to do (\"create engaging and thought provoking content\"), ask _how_.\n\nAsk how to:\n\n* leave your readers with questions\n* write a promising intro\n* how to tell a compelling story\n\n---\n\n# 12 Principles\n\n## 1. Solve a burning problem\n\nWhat problems are your users facing? Use those questions to fuel the content you're creating.\n\nWhy are reddit AMAs so successful? It gives people outlets to ask successful people existing questions.\n\n![Solve a burning problem by providing new answers to existing questions](https://i.imgur.com/sdrbye2.png)\n\n## 2. Find hacks to common struggles\n\nWhat makes \"The Magic Art of Tidying Up\" better than other guides to house cleaning? The solution is framed as a _magical solution_.\n\n\"Does this thing spark joy?\" is a great magic wand to solve a complex problem. This is better than a litmus test of \"have you used it in the last 6 months?\" because it's hard to think back for each item over the last 6 months. It's easy to ask yourself if a thing sparks joy.\n\n> Find hacks to common struggles by offering a simplified solution for completing a task\n\nWhy did 17M people watch [How to Fold a shirt in 15 seconds](https://www.youtube.com/watch?v=uz6rjbw0ZA0)? It's 1) a common task we're all familiar with, and 2) a simplified way of doing it.\n\nWhat tasks is your audience doing on a daily basis, and how could you give them a hack to their common struggle?\n\n## 3. Bust a myth\n\nDisprove a \"common knowledge\" theory.\n\nEx: [Millennials Don’t Suck, You’re Just Old and Hate Change [Infographic]\n](https://venngage.com/blog/millennials-infographic/)\n\nBy busting a myth, you encourage debate, get more links, get more shares, and get more recognition\n\n![By busting a myth, you encourage debate, get more links, get more shares, and get more recognition](https://i.imgur.com/RTnG90b.png)\n\n## 4. Challenge the Status Quo\n\nSimilarly to busting a myth, challenging the status quo gets people talking about you, and get better brand recognition.\n\n## 5. Reframe the Question\n\nIdentify what the question is, then approach it from a different angle.\n\nExample: [The World's deadliest animals](https://www.gatesnotes.com/Health/Most-Lethal-Animal-Mosquito-Week) reframes the question of \"why is the malaria vaccination important\" by reframing the question to \"what are the world's deadliest animals\"\n\n## 6. Bring in a New Perspective\n\nMove away from the traditional perspective to explore topics through a new lens.\n\nEveryone talks about [Stephen Curry](https://en.wikipedia.org/wiki/Stephen_Curry)'s percentage of shots taken, performance, and 3-point game.\n\nHow could you stand out? Talk about NBA Unicorns! Talk about the economics of Stephen Curry! Talk about how CEOs work compared to athletes!\n\n## 7. Mashup Multiple Topics\n\nCombine trending themes with evergreen themes.\n\nIs Star Wars trending? [Combine it with the evergreen theme of good design.](https://venngage.com/blog/7-design-principles-star-wars-taught-us-infographic/)\n\n![Combine trending themes with evergreen themes, like Design and Star Wars](https://i.imgur.com/S9e51e1.jpg)\n\n## 8. Go outside of your immediate field\n\nBroaden your scope to talk about more general problems in your field.\n\n![Look for more general problems in your field](https://i.imgur.com/u5rPJCz.png)\n\n## 9. Find niches and subcultures to comment on\n\nPeople tend to become very obsessive about their subcultures, and those subcultures can grow very quickly.\n\n## 10. Explore and Visualize Origin Stories\n\nOrigin stories are some of the most engaging and inspiring. Think of aspects within your industry that have an interesting history and tell that story!\n\n> For every topic, there is always an origin story.\n\nOrigin stories like \"Marvel's Daredevil\", \"Marvel's Luke Cage\", and \"Marvel's Jessica Jones\" are some of the top viewed Netflix original shows (and some of the highest grossing films in Hollywood).\n\n## 11. Envision the Before and After State\n\n![Help your customer get to a better state](https://i.imgur.com/FWOaM7O.png)\n\nCompare your user's state before and after for what they have, how they feel, what an average day looks like, and what their status is. Here's an example with baby bathtubs:\n\n![Before and after having a baby bathtub](https://i.imgur.com/bsjk4Qb.png)\n\n> Babies are slippery or something, right? This is what I assume it's like to have children - just a constant struggle of \"will I drop it?\"\n\n## 12. Include a reason to share\n\nAsk yourself why your audience should share your content. Will it help them better express themselves?\n\nTrump tweets are viral because people care about what he says. They speak, write and act in response to that care.\n\nhttps://twitter.com/realdonaldtrump/status/265895292191248385\n\n> When people care, they speak, write and act in response to that care.\n\n# Recap\n\n1.  Solve a burning problem\n2.  Find hacks to common struggles\n3.  Bust a myth\n4.  Challenge the status quo\n5.  Reframe the question\n6.  Bring in a new perspective\n7.  Mashup multiple topics\n8.  Go outside your immediate field\n9.  Find niches and subcultures\n10. Explore origin stories\n11. Envision the before and after state\n12. Include a reason to share\n\nAlso, get a free design at [venngage.com/blog/microconf](https://venngage.com/blog/microconf)\n\n---\n\n# Questions\n\n**Has there ever been a pushback from JK Rowling or Star Wars for mashing up their content?**\n\nNah, they're too big to care.\n\n**Have you created content around a very technical topic**\n\nYes - content around our own tools capabilities, like twitter analytics data.\n"
  },
  {
    "title": "Q+A With Patrick Collison, Co-Founder of Stripe",
    "speaker": {
      "name": "Patrick Collison",
      "title": "Co-Founder and CEO of Stripe",
      "twitter": "patrickc",
      "location": "patrick@stripe.com",
      "description": "Fallibilist, optimist. Stripe CEO.",
      "verified": true,
      "image": "https://pbs.twimg.com/profile_images/825622525342199809/_iAaSUQf.jpg",
      "website": "http://patrickcollison.com"
    },
    "date": "2018-04-30 14:39:34 UTC-07:00",
    "conference": "growth",
    "description": "Stripe is a big company - how do they fit into Microconf? They embody the bootstraper ethos - they took it a long way as two dudes in a garage with minimal funding.",
    "image": "https://i.imgur.com/H0XrmwJ.jpg",
    "isPublic": true,
    "body": "\n![Patrick Collison at Microconf Growth 2018](https://i.imgur.com/H0XrmwJ.jpg)\n\nStripe is a big company - how do they fit into Microconf? They embody the bootstraper ethos - they took it a long way as two dudes in a garage with minimal funding.\n\n> For several months, John slept in the garden of our one bedroom apartment.\n\n**Today at Microconf you launched [LLCs on Atlas](https://stripe.com/atlas/guides/llc-vs-c-corp) - congrats!**\n\nFor a while, the top feature request of [Atlas](https://stripe.com/atlas) has been to support LLCs (a relatively new invention).\n\nWe want Atlas to work well for companies that are going to do well, and not a lot of huge companies are LLCs, but early on in a company you don't know what's going to happen. C-corps have a lot of overhead.\n\nLLCs have a lot of options, so fit the ethos of the bootstrapper community better.\n\n**You've launched [Stripe Atlas](https://stripe.com/atlas), now [Stripe LLC](https://stripe.com/atlas/guides/llc-vs-c-corp), the Software engineering magazine [Increment](https://increment.com/), and acquired [Indie Hackers](https://www.indiehackers.com/). These seem as an outsider like random things - can you comment on the overall umbrella of these?**\n\nSo many times in building Stripe, some stupid little speedbump almost stopped it from happening. Our thinking of building Stripe is to increase the number of internet businesses.\n\nWhat determins the number of internet businesses in the world? Why is it that number instead of half that many or twice as many?\n\nAs far as we can tell, it's just a lot of these smaller roadbumps.\n\nWe're very inspired in the things Indie Hackers et. al are doing because we think it's making it easier to start businesses.\n\n60% of customers on Atlas said they wouldn't have started their business if Atlas didn't exist, so we're continuing to look for opportunities like that.\n\n> You don't need to be Mark Zuckerberg to do something incredibly meaningful.\n\nThere's a prevailing Ayn Randian idea of entrepreneurs as lone committed furrowplower, whereas the reality is that the community of people around you that understand your problems is underrated.\n\n**Word of mouth of Stripe spread fast. Was that a deliberate decision on your and [John](https://twitter.com/collision)'s part, or did it just happen because you had a great product?**\n\nWe lucked out. The things we were competing against were comically bad. Our competitors forced you to fax things to them.\n\n> Our competitors were like comic book villains - our competitors forced you to fax things to them\n\nThe banking industry when we started was a lot like the healthcare industry is right now. We all roll our eyes at the current solutions knowing that someone is going to come along and roll over the existing market with a much better product.\n\nThere's a thing that happens to people writing in a corporate voice - they start talking about synnergy and use a whole other vocabulary. We tried to avoid that at Stripe. Expressing yourself honestly isn't something you can generalize, and it lands with people.\n\n**Are there any other marketing channels you've explored that have worked well?**\n\nWe don't have a great track record with names (Stripe was almost paydaemon or `/dev/payments`).\n\nMost users discovered Stripe through our integrations with other products, and those integrations were possible because we had great APIs. We think our expertise is in making APIs (and definitely not naming things).\n\n---\n\n# Questions\n\n**You've talked about very small customers on Stripe Atlas and sophisticated customers - how do you build your product so the new people aren't overwhelmed but the huge customers are still getting what they want?**\n\nThat's **the** core challenge of Stripe. Every feature you add makes the product worse for people who don't use that feature.\n\nStripe should be able to scale through every order of magnitude - from your first to your ten-millionth payment.\n\nI'm pretty sure the right strategy is to go serve the customer at every scale, but how do you do that?\n\nThere are several torturous tactics we use, like partitioning features, using dynamic documentation that just shows you what we think you care about, slowly rolling out features, and using dynamic dashboards that only show you certain things in the sidebar.\n\nWe don't yet have a grand unified theory of how to scale like this - it's becoming an increasingly active discussion.\n\n**How much of your success do you attribute to being in Silicon Valley? Could you have had the same success outside of Silicon Valley?**\n\nBecause we're serving technology companies, we're in a unique position of needing to be around other technology companies.\n\n> I think a smaller fraction of the world's best engineers are outside Silicon Valley now than in the last four years.\n\nI think it's less worthwhile to be in Silicon Valley now than in the last four years. One reason for this is that the cost of living is too high. Collaboration tools are also shifting the calculus towards distributed teams working better than they used to.\n\nThere are also top tier developers all over the world.\n\nIn the next twenty years, we're probably going to see less successful technology companies in Silicon Valley and more around the world.\n\n**Do you support open source projects out of goodwill, or are you getting an ROI from it?**\n\nA lot of things in the world aren't measurable but still have huge benefits.\n\nAt Stripe, we believe in improving open source software and projects like Indie Hackers even though we can't measure the ROI - it just feels important to us. Open source software isn't taken seriously enough by companies benefiting from it.\n\n**How'd you deal with financial regulation?**\n\nIt was very difficult to convince a bank to partner with us - most of them were like 🙅‍.\n\n> We were like three squirrels in a trenchcoat masquerading as a real business.\n\nThere's nothing special about us, though - we were just two guys from Ireland with no connections. Anyone could do this.\n\n**Fraud and chargebacks suck - how are you guys thinking about that?**\n\n> If your chargebacks give you heartburn, imagine seeing all of them.\n\nIt's net good that they exist because it gives consumers confidence to give a rando business their credentials to charge them. It's a great extension of trust that customers have this recourse.\n\nThere are fewer disputes per charge than there ever have been in the past - we think we'll get substantially better still over the next 12 months. Ultimately, though, there's something unsolvable there. It does need to remain easy for consumers to dispute a purchase. What interests me is if structurally we can move beyond that, but it's a complex ecosystem to shepherd.\n\nWe welcome feedback - positive or negative - at patrick@stripe.com. Please email me!\n"
  },
  {
    "title": "Your First 60 Days",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/476049306072276993/s9QMnPC5.jpeg",
      "name": "Patrick McKenzie",
      "title": "Atlas",
      "bioUrl": "http://www.microconf.com/starter/speakers/patrick-mckenzie/",
      "twitter": "patio11",
      "website": "http://www.kalzumeus.com",
      "location": "東京都 Tokyo",
      "description": "I work for the Internet, at @stripe, mostly on Atlas. Opinions here are my own.",
      "verified": false
    },
    "date": "2018-05-03 10:03:27 UTC-07:00",
    "conference": "starter",
    "description": "Microconf 2018 talk recap",
    "image": null,
    "isPublic": true,
    "body": "\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1679128498802440%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fbusiness.facebook.com%2Fteamlanio%2Fvideos%2F1679137985468158%2F&show_text=0&width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\" allowFullScreen=\"true\"></iframe>\n\nhttps://twitter.com/mijustin/status/988986209987842051\n\nPatrick ran a several SaaS companies, and most recently started working at Stripe.\n\n> Microconf lets us lead the life we want to live. We can be more present for our families and our communities. It's not _how_ you do it, it's _why_ you do it.\n\nDon't get caught up in the silicon valley mentality. What are you going to do over the next 40 years?\n\n## Decision making over the long haul:\n\n* make more small bets. Very little of what you do in business are \"trapdoor\" (irreversable) decisions.\n* decide quickly on reversible things that don't matter in the long run. Don't agonize about if you've hit perfection, just get it out the door.\n* do things which still matter in 40 years. You have a sharply limited amount of time as an entrepreneur - do things that will matter years from now. Write about topics that will still matter in 20 years.\n\n> Don't agonize about hitting perfection, just get it out the door.\n\n## Grinding, duh\n\nYou don't need the long term perfect grand strategy, or being an expert, or know what you're doing: you need to go out there every day doing repetitive things that generate small amounts of value, and you need to do it a lot over a long amount of time.\n\n> You need to go out there every day doing repetitive things that generate small amounts of value, and you need to do it a lot over a long amount of time.\n\n## What should I build?\n\n\"What should I build\" is the wrong question to ask first. Ask instead \"who should I serve?\"\n\nWhat communities do you feel a calling towards? This is going to be a part of your life for the next several years, so the audience you pick will have a huge impact on your quality of life.\n\n> \"Are you going to bounce up every morning with enthusiasm at talking to dental offices?\" - \"oh god no!\"\n\nPick people...\n\n* ...who you're energized in talking to\n* ...whose problems are tractable (ie: not \"fight global poverty!\")\n* ...with money (serve people who can afford to pay for solutions)\n\nPatrick bounces with enthusiasm talking to Microconf people! He had a business talking to teachers for 6 years and got really tired talking to them. Find the people you don't get tired talking to.\n\n> Find the people you don't get tired talking to.\n\nIf you have charitable impulses, it's much easier to be charitable with a healthy business behind you.\n\nWe have this image of striving for a business that's all put together. Focus instead on adding a little bit to a puzzle (not a perfect analogy, since there's no end state in business like there is in puzzles).\n\nEvery day, if you've added a piece to your business that wasn't there yesterday and will still be there in years, that's a great metric for success\n\n## Talk to people\n\nIt's never a bad time to talk to a customer or prospect. If you're capable of sending out cold emails, go for it.\n\n## Platform before product\n\nBuild a marketing platform to cater to an audience first.\n\nBuild at least:\n\n* 3 friendcatchers: don't learn to cook because you want to eat food, learn to cook because it's a great excuse to have people over. Build something that solves problems for people and you'll never lack people to talk to who have problems.\n* 5 emails: (we'll talk about this later)\n* ~45 days of grinding: you don't need a grand strategy or a fancy process, just talk/email/tweet to people every day\n\n### The ideal friendcatcher\n\nTODO: ven diagram\n\nThe ideal friendcatcher solves a problem that is resonant, tractable, and underserved.\n\nHow? Pay attention to pain people have. Javascript developers feel visceral pain at the phrase \"build pipeline\" - write about that!\n\nGreat forms of friendcatchers:\n\n* stick-a-fork-in-it-and-it-is-done guide to one broadly applicable, tightly scoped problem: People come to it for years.\n* calculator which replaces an excel spreadsheet: This is unreasonably effective because most people in the world can't program even at the level of silly excel spreadsheet. There's no level too trivial! A/B testing statistical significance is hard for normal people.\n* definitive curated list of resources: listicles! plant a flag on the internet of a definitive list of everything great and outstanding in this field. Josh Kaufman has [the definitive list of business books](https://personalmba.com/best-business-books/).\n* cheatsheet: Amy Hoy made the Ruby on Rails Cheatsheet that turned her into a celebrity in the Rails community\n\n> You can be the person that people are afraid to talk to\n\nTODO: Stripe CTA screenshot\n\n## Email Literally Everyone\n\nCompanies can't do lots of things at scale that you can. When you have ~100 people on your email list that want to hear from you, you have a huge advantage: you can email every single new subscriber individually. Be unreasonably interested in the topic and them. Do it every day until you get sick of it.\n\n### Everything about email courses in one slide\n\n* Make a promise with every subject line and keep it. That's the one copywriting trick you need to know if you know no others.\n* 75% education; 25% sales. You need both. **Ask for the freaking sale at some point**\n* Frontload delivery. 3x in the first week is fine, then back off a little bit.\n* After the end of the course, email 1x every 2-4 weeks.\n\nThere's a world of people - find the people that love hearing from you, and establish the expectation that you'll be sending them more things they like.\n\n### Checkpoints\n\n* 10 great conversations (25 for SaaS)\n* 500 emails\n* 10 commits to buy (in SaaS) or you'll have a super hard time selling it.\n\nYou're going to be talking to customers for the rest of your life. You're not in the \"doing cool stuff with your business phase\" until you've had 10 great conversations (25 for SaaS).\n\nWhy? It's easy to go in the code cave for a few weeks or months.\n\nDon't start the fun expressive work until you've talked to people.\n\nDon't worry about any kind of marketing automation until you have at least 500 people on your list.\n\n## Objective external indicia of progress\n\nPatrick organizes his week like a dinner plate: one main course (50% of work), two side dishes, and everything else is a dessert that probably won't get done. One side dish should always be talking to customers.\n\nFor every piece of work you do (except talking to customers), you should have some indica of progress that's published.\n\n## Build the actual thing\n\nBuilding an awesome thing doesn't mean building the _best_ thing. It doesn't have to be a work of outstanding genius that will be studied 200 years from now.\n\nThe bar for businesses in the economy is _just_ above getting sued. It's disconcerting.\n\n### Abuse your advantages\n\n* \"This is what I do\" is an amazing sales message. Even if you just spend 60 days on something, you'll probably quickly become the world's leading expert in that thing. How many people are studying javascript pipelines? Saying \"This is what I do\" builds a lot of trust with customers. You can be the person that's _unreasonably_ good at the details (like Patrick's loan officer talking to every underwriter for 2 hours)\n* Be _irrationally_ responsive to customers, especially early\n* Most fast and _make things_. Most businesses don't have a development team capable of making _anything_, or a marketing team capable of _selling anything_. Check the microconf archives for more on this.\n\n## Charge more\n\nCharging more will get you more money, get you better customers, and attract people who you want to attract.\n\nHow much more? Whatever your number is right now, raise it.\n\nTODO: reasonable floors, but not ceilings slide\n\nCharge at tiers to segment out customers getting outstanding value from you.\n\n## Stripe Atlas\n\nStripe Atlas helps companies get up and running. They can help create a C-Corp, S-Corp, business bank account, and community of business people to help you through problems.\n\nStripe giving you a business is like giving you a puppy - a year from now your business will be wagging its tale needing compliance and walks.\n\n## Business advice\n\n### Immediately\n\n* get a new credit card: put every business expense on the credit card and it makes accounting a lot easier\n* business gmail/google apps account (ex: `accounts@${domain}`, `receipts@${domain}`)\n* use a password manager (OnePass, etc.)\n\n### Medium term\n\n* get an accountant\n* find a peer group to talk shop with and meet regularly\n* derisk your family life\n  * retirement savings (talk to John Knox)\n  * insurance (term life and long-term disability)\n  * go to the gym like it is your job\n\nChat with patrick at @patio11, [patrick@kalzumeus.com](mailto:patrick@kalzumeus.com), or [patio11@stripe.com](mailto:patio11@stripe.com)\n\n---\n\n# Questions\n\n**Blog posts?**\n\nAhh yes! My blog has ~3M words on it. It was a mistake.\n\nDon't make one of your life commitments keeping it up to date. A dead blog is worse than no blog at all.\n\nInstead of a blog, post articles on your website that are definite evergreen guides.\n\n**How did you become such a good storyteller?**\n\nI'm the storyteller of my Irish Catholic family's generation. It seems to work for me for business, so I lean into it.\n\nI don't have a great guide other than grinding at it. Tell more stories!\n\nTry adopting narrative structure like [the hero's journey](https://en.wikipedia.org/wiki/Hero%27s_journey).\n\n**Do you hate B2C?**\n\nI don't have an emotional hatred of B2C - I don't hate anyone anywhere. Hating people is a commitment of emotional energy in the future, and I'd rather commit to positive things.\n\nGoogle has a war chest of a hundred billion dollars. You can't beat them at the B2C game.\n\nIf you have to, pick a demographic that has some money to pay and is super emotionally invested. Most consumers are pathologically bad at spending money on things. Prosumers like skaters who spend $800 on skates or [the guy who sold gaming tables](#) are better.\n\n**How do you split time spent talking to customers vs. building?**\n\nIt depends on where you are in the cycle. I do 50/25/25 to tactical marketing/talking to customers/product.\n\nIf I didn't have a laser focus of what the product is, I'd spend the 50 on talking to people. Do it first thing in the morning so you can do the trivial, easy, fun stuff of building stuff.\n\n**My favorite talk is your [Hello Ladies talk from Business of software](https://vimeo.com/96701548). How do you build things for people who aren't you?**\n\nEven software for software developers is a huge market opportunity - if you're building software for people similar to you, it's probably still a good market.\n\nSome markets can't pay, so don't serve a market like that. A market like \"women in tech positions\" is a great underserved market.\n"
  },
  {
    "title": "12 Lessons I learned Moving from Bootstrapped to Venture Backed",
    "speaker": {
      "image": "https://pbs.twimg.com/profile_images/537394665775833088/N1JHDvju.png",
      "name": "Rob Walling",
      "title": "Drip",
      "bioUrl": "https://www.microconf.com/growth/speakers/rob-walling/",
      "twitter": "robwalling",
      "website": "http://www.robwalling.com",
      "location": "Minneapolis, MN",
      "description": "Serial Entrepreneur. Co-founder of https://www.drip.com/ and http://www.microconf.com/. I'm rarely on Twitter.",
      "verified": false
    },
    "date": "2018-04-30 17:12:38 UTC-07:00",
    "conference": "growth",
    "description": "I am not anti-venture capital. I am anti-everyone-thinking-venture-capital-is-the-only-way-to-start-a-tech-company. If you’re self-funded with one or two founders, you can support your entire business from a tiny niche that provides $20k/month in revenue.",
    "image": "https://i.imgur.com/M3tcMmj.png",
    "isPublic": true,
    "body": "\n<!-- ![Rob Walling at Microconf Growth 2018](https://i.imgur.com/aSdxyq5.jpg) -->\n\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/rob-walling/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\n<!-- https://microconf2018.nyc3.digitaloceanspaces.com/Rob%20Walling%20-%20Recap.mp3 -->\n\nRob is a serial entrepreneur that most recently started [Drip](https://www.drip.com/), which was [acquired by Leadpages in 2016](https://www.leadpages.net/blog/drip-acquisition/).\n\n> I am not anti-venture capital. I am anti-everyone-thinking-venture-capital-is-the-only-way-to-start-a-tech-company.\n\n> If you’re self-funded with one or two founders, you can support your entire business from a tiny niche that provides $20k/month in revenue.\n\n> But with venture capital (or even... angel funding) you are forced to go after much larger markets. And a market that's 10x the size is 100x harder to get right. There’s more competition, more complexity, higher ad rates, etc.\n\nHaving done both bootstrapping and a funded business, Rob knows the good and bad parts of VC funding.\n\n# The Bad\n\n## 1. Communication is painful\n\nLaunching multiple features a week is much harder when you're not bootstrapped\n\n> At times I feel like I spend more time talking about building product than actually building product.\n\n## 2. Board meetings are a pain in the ass\n\n## 3. Culture is Hard\n\nWhen you hit 15 or 20 employees, culture gets really hard.\n\nIt's easy to do it badly (like with a [mission statement generator](http://www.joe-ks.com/archives_feb2001/ManualMSG.htm)).\n\nThe [Netflix Culture Document](https://jobs.netflix.com/culture) and [Balsamiq Culture Document](https://blog.balsamiq.com/mantras/) do it well.\n\n## 4. Hire for both skill and personality\n\nIf you hire just for skill, you get folks in who aren't a good fit.\n\nIf you hire just for personality, you have to train everyone and can't move very fast.\n\n## 5. Things Rob never had to deal with\n\nClassic things like raising funding, monthly reporting, annual audits, and legal complexities Rob didn't need to deal with.\n\n# The Good\n\n## 1. You can hire specialists\n\nSpecialists and partnerships give you a huge boost in growth and make it easier to run your company. Areas like HR, specialized developers, and GDPR are ripe for specialists.\n\n## 2. Pay Market Salaries\n\nEarly on, Rob lost a great developer because of a $10k difference in salary. Having more money means you don't need to make this compromise.\n\n![Being venture baked lets you pay market salaries](https://i.imgur.com/YA61Htz.png)\n\n## 3. Hire Senior Talent\n\nOnly being able to afford junior developers means you move much slower.\n\n![Only being able to afford junior developers means you move much slower.](https://i.imgur.com/Sf22YOe.png)\n\n## 4. Use a recruiter\n\nAs a bootstrapped founder, you don't realize how much of your time you spend on hiring.\n\n_If_ Rob starts another company, he'd hire a recruiter a lot earlier.\n\n## 5. Don't waste time to save a few dollars\n\nAs a bootstrapped founder, you feel compelled to penny pinch and save little dollar amounts in places like AWS, which is taking away focus from the rest of what you're trying to do.\n\n![Don't waste time to save a few dollars - just increase your revenue](https://i.imgur.com/FqqbHtY.jpg)\n\nWhat's wasted time? If you're evaluating Kayako or intercom and thinking mostly about price, you're probably wasting your time. Same for Zoho vs. Gmail, Wistia vs. Sprout Vieo, GoDaddy Hosting vs. WPEngine, etc.\n\n## 6. Use Standard Job Titles\n\nIn a bootstrapped company, you just make up job titles. Once you have a recruiter who's searching for new people to fill your made up positions (ex: \"Senior Scaling Architect\"), your life will be much easier if you use more standard titles.\n\nAlso, don't elevate titles too early. If you hire a normal customer success person, don't name them \"Head of Customer Success\".\n\n## 7. Be less stressed?\n\nYou can be a hell of a lot less stressed when you can just hire people to handle the tedious problems of business. It's not guaranteed to make you less stressed, though.\n\n![Does venture funding make you more or less stressed? @jordangal](https://i.imgur.com/NP5MLAv.jpg)\n\n![Does venture funding make you more or less stressed? @sdmattg](https://i.imgur.com/SymBGzQ.png)\n\n![Does venture funding make you more or less stressed? @Jus10McGill](https://i.imgur.com/RB71jxG.png)\n\n# So... what can you do?\n\nRob isn't saying you _should_ raise funding, but there are definitely things to learn from it.\n\nHere are some options:\n\n* continue bootstrapping\n* consider VC-Funding (gross)\n* \"Fundstrapping\": raise some money at the beginning, then never raise money again\n\nWhen fundstrapping, boostrap to $20-30k MRR, then raise a single Angel round. You'll get the best of both worlds.\n\n# tl;dr:\n\nFunding lets you:\n\n* Hire for specialization\n* Pay market salaries\n* Hire senior talent\n* Hire faster\n* Work with a recruiter\n* Not waste time to save a few $$\n* Use standard job titles\n* Be less stressed\n\n\"Fundstrap\" with a single round of funding to get the benefits.\n\n---\n\n# Questions\n\n**Did you have to answer to a board?**\n\nWe had enough luxury to hand pick who was on our board, and we got along really will with them. It could've been a shit show.\n\n**It sounds like a lot of your negative parts of funding are just things that happen at scale.**\n\nIt's exacerbated when you have funding. Basecamp has grown over 12 years; hiring ~4 people a year makes it much easier to establish culture. Moving faster with funding makes it a lot harder to establish culture.\n\n**Do you have advice on protecting culture?**\n\nYes - write things down, and hire people who are on board with your written vision.\n\n**Is there anything else you wish you could've afforded?**\n\nCustomer acquisition! Leadpages perfected the paid acquisition revenue model.\n\n**As a micropreneur, what's the advantage of fundstrapping over a bank loan?**\n\nIf you want to be a solopreneur, grow something up to $10k or $20k MRR and have an awesome lifestyle business. Rob did that for several years and eventually wanted something more.\n\nThe advantage over a bank loan is that it's lower risk - if the business fails, your personal credit isn't destroyed.\n\n**If I fundstrap, how much of my business do I need to give up?**\n\nFirst bootstrap to the $20-30k MRR mark so you have a $4-6M valuation, then sell 10% for ~$500k.\n\n**When do you pay it back?**\n\nEither when you get acquired or by paying dividends.\n"
  },
  {
    "title": "The Path to Parallel Entrepreneurship",
    "speaker": {
      "name": "Ryan Buckley",
      "twitter": "rbucks",
      "location": "Walnut Creek, CA",
      "description": "Founder of Toofr, eNPS, Thinbox. Fmr CEO/cofounder of Scripted. Believer in bootstrapping. Resident of Contra Costa County. I do @emailpatterns.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/878454035501637637/Xhy21BOV.jpg",
      "website": "https://www.toofr.com"
    },
    "date": "2018-04-30 16:06:44 UTC-07:00",
    "conference": "growth",
    "description": "Parallel entrepreneurship has a negative stigma, but there are a lot of people in this room that do it successfully.",
    "image": "https://i.imgur.com/76IDvbD.png",
    "isPublic": true,
    "body": "\nParallel entrepreneurship has a negative stigma, but there are a lot of people in this room that do it successfully.\n\nThere are also several public examples of superhuman parallel entrepreneurs:\n\n* Jack Dorsey (Twitter and Square)\n* Marcia Kilgore (Bliss, Soap & Glory, FitFlop, Soaper Duper, Beauty Pie)\n* Elon Musk (freakin' everything)\n\n![Elon Musk is Tony Stark](https://i.imgur.com/H6WbEO5.png)\n\n> Why should investors get to invest in parallel startups and entrepreneurs only get to work on one?\n\n## Reasons to be a parallel entrepreneur (from surveys)\n\n* Pursuing a passion\n* diversifying and de-risking\n* developing a new skill\n* being more productive\n* exploring a new career\n\nMost parallel entrepreneurs have backgrounds in writing or finance, not programming. They're able to switch between different projects by being very regimented and being creative about their resources.\n\nFun fact: most parallel entrepreneurs structure their businesses as LLCs.\n\n### Entrepreneurs surveyed\n\n* [Max Altschuler](https://twitter.com/hackitmax): [Sales Hacker](https://www.saleshacker.com/), SUTRA\n* [Josh Pigford](https://twitter.com/shpigford): [Baremetrics](https://baremetrics.com/), [Cedar & Sail](https://cedarandsail.com/)\n* [Ryan Buckley](https://twitter.com/rbucks): Scripted, Toofr, Inlistio, Voxloca (tip: stick with a single tech stack, like Rails/Postgres/Heroku)\n\n![The Parallel Entrepreneur by @rbucks](https://i.imgur.com/aL5g9Fu.jpg)\n"
  },
  {
    "title": "Lessons From Over 100 Million Dollars in Deals",
    "speaker": {
      "name": "Thomas Smale",
      "twitter": "ThomasSmale",
      "location": "Boston and London",
      "description": "Founder of FE International. We help sell online businesses. Speaker. Columnist at https://www.entrepreneur.com/",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/560388726820323328/y6DXcyiD.jpeg",
      "website": "http://feinternational.com"
    },
    "date": "2018-05-02 14:48:26 UTC-07:00",
    "oldDate": "2018-04-30 16:32:09 UTC-07:00",
    "conference": "starter",
    "description": "Since founding FE International in 2006, Thomas has done several hundred million dollars in deals. They invest loads of time with each business to increase the selling success rate. Here's how.",
    "image": "https://i.imgur.com/ENZeXK9.png",
    "isPublic": true,
    "isAttendee": true,
    "body": "\n<iframe sandbox=\"allow-scripts allow-same-origin\" security=\"restricted\" src=\"https://lan.io/blog/podcast/thomas-smale/embed/\" width=\"100%\" height=\"700\" title=\"Rob Walling Recap Interview - Lanio\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"></iframe>\n<script type='text/javascript'>const wp = document.querySelector(\".wp-embedded-content\"); window.addEventListener(\"message\", ({data, origin}) => {if(origin === \"https://lan.io\" && data && data.message === \"height\" && data.value) wp.height = data.value})</script>\n\nWhatever stage you're at in your business - starting, or ready to sell- one day you're going to leave your business. Hopefully it's by a successful exit.\n\n![We are all going to leave our business someday. Hopefully it's by a successful exit.](https://i.imgur.com/bJRaTXW.png)\n\n## Thomas and FE International\n\nSince founding FE International in 2006, Thomas has done several hundred million dollars in deals. They invest loads of time with each business to increase the selling success rate (currently 94.1% for FE International, vs. ~20% in the industry).\n\nIn the last several months, Thomas has done several deals ranging from a few hundred thousand to a few hundred million.\n\nHere are the top lessons Thomas works with entrepreneurs on to sell their businesses.\n\n## Lesson 0: Get your ducks in a row\n\n![Write down all your processes and improve it with time](https://i.imgur.com/YDNPByF.png)\n\n## Lesson 1: Take Incremental and Measurable Risks\n\nWhen you do come to sell, you need to be in a position to prove any of your claims. If you claim your users doubled over a period, you need to show how you measured that.\n\nIf you want to test pricing, incrementally measure the success of testing pricing on a smaller group.\n\nCompanies that have been successfully sold take small, incremental risks. If you're not failing often, you're not trying hard enough. You should be continually testing experiments to see what works.\n\n> Companies that have been successfully sold take small, incremental risks.\n\n## Lesson 2: Make it sustainable\n\n![](https://i.imgur.com/rBoZtnI.png)\n\nKey mistakes when people are just starting out is to give away far too much value for not a lot of return. Don't sell lifetime subscriptions to your product to a cheap price. Don't give away annual plans at a massive discount.\n\n## Lesson 3: Focus on MRR growth and revenue churn\n\n![](https://i.imgur.com/EyVRhTY.png)\n\nIf you're ever going to sell, MRR growth is a big factor. Focus on sustainably growing MRR and decreasing revenue churn (customer churn doesn't matter as much).\n\nPeople paying you the most money are probably sending you the least number of complaints. Put things in place to keep those valuable customers happy and you can churn the lower value customers without affecting revenue churn.\n\n> A decision that raises revenue even though it churns vocal users is a good decision.\n\nWord of mouth has a CAC of zero, but it's hard to scale a business whose growth strategy is word of mouth.\n\nIgnore customer churn and focus on revenue churn. Focus more on the cohorts that are paying you the most.\n\nDon't fall victim to feature creep: focus on revenue.\n\n> Almost every SaaS business out there doesn't do pricing very well.\n\nBuild in expansion revenue. Don't have an unlimited plan, let users pay you more the more they use your platform.\n\n## Lesson 4: Sell at the right time\n\n![](https://i.imgur.com/WWaMDbZ.png)\n\nSell while it's still growing - don't wait until it's shrinking.\n\n## Questions on selling your business?\n\nAsk [@ThomasSmale](https://twitter.com/ThomasSmale)\n"
  },
  {
    "title": "The Dinner Party Strategy: A SaaS Customer Onboarding Framework That Connects and Converts",
    "speaker": {
      "name": "Val Geisler",
      "twitter": "lovevalgeisler",
      "location": "Columbus, OH",
      "description": "#emailgeek writing Onboarding Tear Downs. Email conversion strategist & copywriter. Mom, feminist, avid reader.",
      "verified": false,
      "image": "https://pbs.twimg.com/profile_images/976882873369325570/q1P7vq_n.jpg",
      "website": "http://www.valgeisler.com"
    },
    "date": "2018-05-01 11:15:58 UTC-07:00",
    "conference": "growth",
    "description": "Do you feel completely overwhelmed by the idea of segmenting your list? Aren’t sure what kinds of emails to send besides links to your latest blog posts? Val is a marketing conversion copywriter + strategist that can help.",
    "image": "https://i.imgur.com/uE2sqkw.png",
    "isPublic": true,
    "facebookStream": "https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fteamlanio%2Fvideos%2F1676996419015648%2F&show_text=0&width=560",
    "body": "\nHere's an email onboarding strategy made to stick in your brain.\n\nIf you send emails to your list, but feel completely overwhelmed at the idea of segmenting your list and don't want to over-email your list, this is for you.\n\n## Val Geisler\n\n* Email marketing conversion copywriter + strategist\n* Worked in-house as the #1 marketer at an email marketing software\n* [Email onboarding tear downs on Val's website](http://www.valgeisler.com)\n* Obsessed with churn reduction through email\n* Worked with brands like AccessAlly, Pick, Beacon, Podia, Acuity Scheduling, and more\n\n# Email Marketing Dinner Party Strategy\n\nThere's no one right answer for email marketing. **Test everything** and you can be an email pro! If you wrote your campaign years ago, it's time to revisit it.\n\n> There's no one right answer for email marketing. Test everything and you can be an email pro!\n\n![Plan your email campaign like you would plan a dinner party](https://i.imgur.com/wdv53yE.png)\n\nStart your email marketing by just saying hi!\n\n![\"just saying hey\" is a great friendly way to start your email onboarding party](https://i.imgur.com/S1LK0Ra.png)\n\nAs an apatizer, add value:\n\n![](https://i.imgur.com/OymoXEF.png)\n\nThe main course is your product (you wouldn't serve the main course as the first course, right?):\n\n![The main course of email marketing is your product](https://i.imgur.com/LK6uTSW.png)\n\nSide dishes offer more value\n\n![Super long copy works if your users are already hungry](https://i.imgur.com/rWRVXuX.jpg)\n\nOffer your users a dessert bonus!\n\n![dessert](https://i.imgur.com/6pJFbKM.png)\n\nOnce you've had your guests for dinner, invite them back!\n\n![Extending a user's trial is a great way to get them to come back](https://i.imgur.com/qgXmJXx.png)\n\n### Avoid the SPAM trap\n\nAbove all else, be useful, get personal, and limit distractions.\n\n## Recap\n\nCreating high value onboarding campaigns for your customers is so doable. Building and connecting with new customers has revolutionized Val's client’s businesses\n\nThis is NOT just theory. This is exactly what Val does every day with her clients, and they are exactly the same principles you can use on for any campaign (onboarding, retention, etc.).\n\nheygirl@valgeisler.com\n"
  }
]